[Killed] ConditionalExpression
HuntingRules.js:296:7
 }
 
 function fire(state) {
-  if (state.phase !== "playing") return state
+  if (true) return state
   if (state.ammo <= 0) {
     return settle(state, "ammunition")
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.057689
  type: 'test'

[Killed] EqualityOperator
HuntingRules.js:296:7
 }
 
 function fire(state) {
-  if (state.phase !== "playing") return state
+  if (state.phase === "playing") return state
   if (state.ammo <= 0) {
     return settle(state, "ammunition")
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.974043

[Killed] EqualityOperator
HuntingRules.js:297:7
 
 function fire(state) {
   if (state.phase !== "playing") return state
-  if (state.ammo <= 0) {
+  if (state.ammo > 0) {
     return settle(state, "ammunition")
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.995142
  type: 'test'

[Killed] ConditionalExpression
HuntingRules.js:297:7
 
 function fire(state) {
   if (state.phase !== "playing") return state
-  if (state.ammo <= 0) {
+  if (false) {
     return settle(state, "ammunition")
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 15.689486

[Killed] EqualityOperator
HuntingRules.js:300:7
   if (state.ammo <= 0) {
     return settle(state, "ammunition")
   }
-  if (state.cooldownTicks > 0) {
+  if (state.cooldownTicks <= 0) {
     state.message = "Wait before firing again"
     return state
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.51508

[Killed] ConditionalExpression
HuntingRules.js:300:7
   if (state.ammo <= 0) {
     return settle(state, "ammunition")
   }
-  if (state.cooldownTicks > 0) {
+  if (false) {
     state.message = "Wait before firing again"
     return state
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.823523

[Killed] AssignmentOperator
HuntingRules.js:305:3
     return state
   }
 
-  state.ammo -= 1
+  state.ammo += 1
   state.shotsFired += 1
   state.cooldownTicks = state.assist ? 3 : 4
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.559322
  type: 'test'

[Killed] AssignmentOperator
HuntingRules.js:306:3
   }
 
   state.ammo -= 1
-  state.shotsFired += 1
+  state.shotsFired -= 1
   state.cooldownTicks = state.assist ? 3 : 4
   state.noise = clamp(state.noise + 18, 0, 100)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.439959
  type: 'test'
  ...

[Killed] ArithmeticOperator
HuntingRules.js:308:23
   state.ammo -= 1
   state.shotsFired += 1
   state.cooldownTicks = state.assist ? 3 : 4
-  state.noise = clamp(state.noise + 18, 0, 100)
+  state.noise = clamp(state.noise - 18, 0, 100)
   var target = targetForShot(state)
   if (!target) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.323182

[Killed] ConditionalExpression
HuntingRules.js:310:7
   state.cooldownTicks = state.assist ? 3 : 4
   state.noise = clamp(state.noise + 18, 0, 100)
   var target = targetForShot(state)
-  if (!target) {
+  if (false) {
     state.message = state.ammo === 0 ? "The shot missed. You are out of ammunition" : "The shot missed"
     if (state.ammo === 0) settle(state, "ammunition")
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 3.955227

[Killed] BlockStatement
HuntingRules.js:310:16
   state.cooldownTicks = state.assist ? 3 : 4
   state.noise = clamp(state.noise + 18, 0, 100)
   var target = targetForShot(state)
-  if (!target) {
-    state.message = state.ammo === 0 ? "The shot missed. You are out of ammunition" : "The shot missed"
-    if (state.ammo === 0) settle(state, "ammunition")
-    return state
-  }
+  if (!target) {}
 
   target.alive = false
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.788929
  type: 'test'

[Killed] ConditionalExpression
HuntingRules.js:311:21
   state.noise = clamp(state.noise + 18, 0, 100)
   var target = targetForShot(state)
   if (!target) {
-    state.message = state.ammo === 0 ? "The shot missed. You are out of ammunition" : "The shot missed"
+    state.message = true ? "The shot missed. You are out of ammunition" : "The shot missed"
     if (state.ammo === 0) settle(state, "ammunition")
     return state
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.749185

[Killed] EqualityOperator
HuntingRules.js:311:21
   state.noise = clamp(state.noise + 18, 0, 100)
   var target = targetForShot(state)
   if (!target) {
-    state.message = state.ammo === 0 ? "The shot missed. You are out of ammunition" : "The shot missed"
+    state.message = state.ammo !== 0 ? "The shot missed. You are out of ammunition" : "The shot missed"
     if (state.ammo === 0) settle(state, "ammunition")
     return state
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 6.387663
  type: 'test'

[Killed] ConditionalExpression
HuntingRules.js:312:9
   var target = targetForShot(state)
   if (!target) {
     state.message = state.ammo === 0 ? "The shot missed. You are out of ammunition" : "The shot missed"
-    if (state.ammo === 0) settle(state, "ammunition")
+    if (true) settle(state, "ammunition")
     return state
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.761407

[Killed] ConditionalExpression
HuntingRules.js:312:9
   var target = targetForShot(state)
   if (!target) {
     state.message = state.ammo === 0 ? "The shot missed. You are out of ammunition" : "The shot missed"
-    if (state.ammo === 0) settle(state, "ammunition")
+    if (false) settle(state, "ammunition")
     return state
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.649119

[Killed] BooleanLiteral
HuntingRules.js:316:18
     return state
   }
 
-  target.alive = false
+  target.alive = true
   target.hit = true
   state.hits += 1
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.357897
  type: 'test'
  ...

[Killed] BooleanLiteral
HuntingRules.js:317:16
   }
 
   target.alive = false
-  target.hit = true
+  target.hit = false
   state.hits += 1
   var traits = SPECIES[target.species]
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.770615

[Killed] AssignmentOperator
HuntingRules.js:318:3
 
   target.alive = false
   target.hit = true
-  state.hits += 1
+  state.hits -= 1
   var traits = SPECIES[target.species]
   var room = Math.max(0, state.carryCapacity - state.carriedPounds)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.218538
  type: 'test'

[Killed] MethodExpression
HuntingRules.js:320:14
   target.hit = true
   state.hits += 1
   var traits = SPECIES[target.species]
-  var room = Math.max(0, state.carryCapacity - state.carriedPounds)
+  var room = Math.min(0, state.carryCapacity - state.carriedPounds)
   var carried = Math.min(room, traits.yieldPounds)
   var wasted = traits.yieldPounds - carried
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.008307

[Killed] ArithmeticOperator
HuntingRules.js:320:26
   target.hit = true
   state.hits += 1
   var traits = SPECIES[target.species]
-  var room = Math.max(0, state.carryCapacity - state.carriedPounds)
+  var room = Math.max(0, state.carryCapacity + state.carriedPounds)
   var carried = Math.min(room, traits.yieldPounds)
   var wasted = traits.yieldPounds - carried
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.527833

[Killed] MethodExpression
HuntingRules.js:321:17
   state.hits += 1
   var traits = SPECIES[target.species]
   var room = Math.max(0, state.carryCapacity - state.carriedPounds)
-  var carried = Math.min(room, traits.yieldPounds)
+  var carried = Math.max(room, traits.yieldPounds)
   var wasted = traits.yieldPounds - carried
   state.harvestedPounds += traits.yieldPounds
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.378955
  type: 'test'

[Killed] ArithmeticOperator
HuntingRules.js:322:16
   var traits = SPECIES[target.species]
   var room = Math.max(0, state.carryCapacity - state.carriedPounds)
   var carried = Math.min(room, traits.yieldPounds)
-  var wasted = traits.yieldPounds - carried
+  var wasted = traits.yieldPounds + carried
   state.harvestedPounds += traits.yieldPounds
   state.carriedPounds += carried
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.124332
  type: 'test'

[Killed] AssignmentOperator
HuntingRules.js:323:3
   var room = Math.max(0, state.carryCapacity - state.carriedPounds)
   var carried = Math.min(room, traits.yieldPounds)
   var wasted = traits.yieldPounds - carried
-  state.harvestedPounds += traits.yieldPounds
+  state.harvestedPounds -= traits.yieldPounds
   state.carriedPounds += carried
   state.wastedPounds += wasted
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.255696

[Killed] AssignmentOperator
HuntingRules.js:324:3
   var carried = Math.min(room, traits.yieldPounds)
   var wasted = traits.yieldPounds - carried
   state.harvestedPounds += traits.yieldPounds
-  state.carriedPounds += carried
+  state.carriedPounds -= carried
   state.wastedPounds += wasted
   state.score += carried > 0 ? Math.round(traits.points * carried / traits.yieldPounds) + carried : 0
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.88122
  type: 'test'

[Killed] AssignmentOperator
HuntingRules.js:325:3
   var wasted = traits.yieldPounds - carried
   state.harvestedPounds += traits.yieldPounds
   state.carriedPounds += carried
-  state.wastedPounds += wasted
+  state.wastedPounds -= wasted
   state.score += carried > 0 ? Math.round(traits.points * carried / traits.yieldPounds) + carried : 0
   state.message = carried > 0
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.339782

[Killed] ConditionalExpression
HuntingRules.js:326:18
   state.harvestedPounds += traits.yieldPounds
   state.carriedPounds += carried
   state.wastedPounds += wasted
-  state.score += carried > 0 ? Math.round(traits.points * carried / traits.yieldPounds) + carried : 0
+  state.score += false ? Math.round(traits.points * carried / traits.yieldPounds) + carried : 0
   state.message = carried > 0
     ? "Harvested " + carried + " lb from a " + traits.label
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 6.977039
  type: 'test'

[Killed] AssignmentOperator
HuntingRules.js:326:3
   state.harvestedPounds += traits.yieldPounds
   state.carriedPounds += carried
   state.wastedPounds += wasted
-  state.score += carried > 0 ? Math.round(traits.points * carried / traits.yieldPounds) + carried : 0
+  state.score -= carried > 0 ? Math.round(traits.points * carried / traits.yieldPounds) + carried : 0
   state.message = carried > 0
     ? "Harvested " + carried + " lb from a " + traits.label
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.50501
  type: 'test'

[Survived] ConditionalExpression
HuntingRules.js:327:19
   state.carriedPounds += carried
   state.wastedPounds += wasted
   state.score += carried > 0 ? Math.round(traits.points * carried / traits.yieldPounds) + carried : 0
-  state.message = carried > 0
+  state.message = false
     ? "Harvested " + carried + " lb from a " + traits.label
     : "No room left. The harvest was wasted"

[Survived] EqualityOperator
HuntingRules.js:327:19
   state.carriedPounds += carried
   state.wastedPounds += wasted
   state.score += carried > 0 ? Math.round(traits.points * carried / traits.yieldPounds) + carried : 0
-  state.message = carried > 0
+  state.message = carried <= 0
     ? "Harvested " + carried + " lb from a " + traits.label
     : "No room left. The harvest was wasted"

[Killed] BlockStatement
HuntingRules.js:330:51
   state.message = carried > 0
     ? "Harvested " + carried + " lb from a " + traits.label
     : "No room left. The harvest was wasted"
-  if (state.carriedPounds >= state.carryCapacity) {
-    settle(state, "carry")
-  } else if (state.ammo === 0) {
+  if (state.carriedPounds >= state.carryCapacity) {} else if (state.ammo === 0) {
     settle(state, "ammunition")
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.791453
  type: 'test'

[Killed] EqualityOperator
HuntingRules.js:330:7
   state.message = carried > 0
     ? "Harvested " + carried + " lb from a " + traits.label
     : "No room left. The harvest was wasted"
-  if (state.carriedPounds >= state.carryCapacity) {
+  if (state.carriedPounds > state.carryCapacity) {
     settle(state, "carry")
   } else if (state.ammo === 0) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 9.812663
  type: 'test'

[Killed] CallExpression
HuntingRules.js:331:5
     ? "Harvested " + carried + " lb from a " + traits.label
     : "No room left. The harvest was wasted"
   if (state.carriedPounds >= state.carryCapacity) {
-    settle(state, "carry")
+    ;
   } else if (state.ammo === 0) {
     settle(state, "ammunition")
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.363337

[Killed] ConditionalExpression
HuntingRules.js:332:14
     : "No room left. The harvest was wasted"
   if (state.carriedPounds >= state.carryCapacity) {
     settle(state, "carry")
-  } else if (state.ammo === 0) {
+  } else if (false) {
     settle(state, "ammunition")
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.647054
  type: 'test'

[Killed] BlockStatement
HuntingRules.js:332:32
     : "No room left. The harvest was wasted"
   if (state.carriedPounds >= state.carryCapacity) {
     settle(state, "carry")
-  } else if (state.ammo === 0) {
-    settle(state, "ammunition")
-  }
+  } else if (state.ammo === 0) {}
   return state
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.348961
  type: 'test'

[Killed] CallExpression
HuntingRules.js:333:5
   if (state.carriedPounds >= state.carryCapacity) {
     settle(state, "carry")
   } else if (state.ammo === 0) {
-    settle(state, "ammunition")
+    ;
   }
   return state
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.893152

[Killed] ConditionalExpression
HuntingRules.js:339:7
 }
 
 function settle(state, reason) {
-  if (state.result) return state
+  if (false) return state
   var region = REGIONS[state.region]
   var seasonSpoilage = state.season === "summer" ? 0.10 : state.season === "winter" ? 0.02 : 0.05
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.32165

[Killed] ConditionalExpression
HuntingRules.js:339:7
 }
 
 function settle(state, reason) {
-  if (state.result) return state
+  if (true) return state
   var region = REGIONS[state.region]
   var seasonSpoilage = state.season === "summer" ? 0.10 : state.season === "winter" ? 0.02 : 0.05
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.13366

[Killed] EqualityOperator
HuntingRules.js:341:59
 function settle(state, reason) {
   if (state.result) return state
   var region = REGIONS[state.region]
-  var seasonSpoilage = state.season === "summer" ? 0.10 : state.season === "winter" ? 0.02 : 0.05
+  var seasonSpoilage = state.season === "summer" ? 0.10 : state.season !== "winter" ? 0.02 : 0.05
   var spoilagePounds = Math.min(state.carriedPounds, Math.floor(state.carriedPounds * seasonSpoilage))
   var riskDraw = nextRandom(state.rngState)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.257169
  type: 'test'
  ...

[Killed] EqualityOperator
HuntingRules.js:341:24
 function settle(state, reason) {
   if (state.result) return state
   var region = REGIONS[state.region]
-  var seasonSpoilage = state.season === "summer" ? 0.10 : state.season === "winter" ? 0.02 : 0.05
+  var seasonSpoilage = state.season !== "summer" ? 0.10 : state.season === "winter" ? 0.02 : 0.05
   var spoilagePounds = Math.min(state.carriedPounds, Math.floor(state.carriedPounds * seasonSpoilage))
   var riskDraw = nextRandom(state.rngState)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.434931
  type: 'test'

[Killed] MethodExpression
HuntingRules.js:342:24
   if (state.result) return state
   var region = REGIONS[state.region]
   var seasonSpoilage = state.season === "summer" ? 0.10 : state.season === "winter" ? 0.02 : 0.05
-  var spoilagePounds = Math.min(state.carriedPounds, Math.floor(state.carriedPounds * seasonSpoilage))
+  var spoilagePounds = Math.max(state.carriedPounds, Math.floor(state.carriedPounds * seasonSpoilage))
   var riskDraw = nextRandom(state.rngState)
   state.rngState = riskDraw.seed
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.115355

[Killed] ArithmeticOperator
HuntingRules.js:342:65
   if (state.result) return state
   var region = REGIONS[state.region]
   var seasonSpoilage = state.season === "summer" ? 0.10 : state.season === "winter" ? 0.02 : 0.05
-  var spoilagePounds = Math.min(state.carriedPounds, Math.floor(state.carriedPounds * seasonSpoilage))
+  var spoilagePounds = Math.min(state.carriedPounds, Math.floor(state.carriedPounds / seasonSpoilage))
   var riskDraw = nextRandom(state.rngState)
   state.rngState = riskDraw.seed
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.8759
  type: 'test'

[Killed] ConditionalExpression
HuntingRules.js:345:16
   var spoilagePounds = Math.min(state.carriedPounds, Math.floor(state.carriedPounds * seasonSpoilage))
   var riskDraw = nextRandom(state.rngState)
   state.rngState = riskDraw.seed
-  var injury = riskDraw.value * 100 < region.risk
+  var injury = true
   var energyCost = region.energy + (injury ? 6 : 0)
   state.carriedPounds -= spoilagePounds
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.557808
  type: 'test'
  ...

[Killed] ArithmeticOperator
HuntingRules.js:345:16
   var spoilagePounds = Math.min(state.carriedPounds, Math.floor(state.carriedPounds * seasonSpoilage))
   var riskDraw = nextRandom(state.rngState)
   state.rngState = riskDraw.seed
-  var injury = riskDraw.value * 100 < region.risk
+  var injury = riskDraw.value / 100 < region.risk
   var energyCost = region.energy + (injury ? 6 : 0)
   state.carriedPounds -= spoilagePounds
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.708688
  type: 'test'

[Killed] ArithmeticOperator
HuntingRules.js:346:20
   var riskDraw = nextRandom(state.rngState)
   state.rngState = riskDraw.seed
   var injury = riskDraw.value * 100 < region.risk
-  var energyCost = region.energy + (injury ? 6 : 0)
+  var energyCost = region.energy - (injury ? 6 : 0)
   state.carriedPounds -= spoilagePounds
   state.wastedPounds += spoilagePounds
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.921985

[Killed] AssignmentOperator
HuntingRules.js:347:3
   state.rngState = riskDraw.seed
   var injury = riskDraw.value * 100 < region.risk
   var energyCost = region.energy + (injury ? 6 : 0)
-  state.carriedPounds -= spoilagePounds
+  state.carriedPounds += spoilagePounds
   state.wastedPounds += spoilagePounds
   state.score = Math.max(0, state.score - state.wastedPounds)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.421024

[Killed] AssignmentOperator
HuntingRules.js:348:3
   var injury = riskDraw.value * 100 < region.risk
   var energyCost = region.energy + (injury ? 6 : 0)
   state.carriedPounds -= spoilagePounds
-  state.wastedPounds += spoilagePounds
+  state.wastedPounds -= spoilagePounds
   state.score = Math.max(0, state.score - state.wastedPounds)
   state.phase = "complete"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.910906
  type: 'test'

[Killed] ArithmeticOperator
HuntingRules.js:349:29
   var energyCost = region.energy + (injury ? 6 : 0)
   state.carriedPounds -= spoilagePounds
   state.wastedPounds += spoilagePounds
-  state.score = Math.max(0, state.score - state.wastedPounds)
+  state.score = Math.max(0, state.score + state.wastedPounds)
   state.phase = "complete"
   state.returnPending = false
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 7.492557

[Killed] MethodExpression
HuntingRules.js:349:17
   var energyCost = region.energy + (injury ? 6 : 0)
   state.carriedPounds -= spoilagePounds
   state.wastedPounds += spoilagePounds
-  state.score = Math.max(0, state.score - state.wastedPounds)
+  state.score = Math.min(0, state.score - state.wastedPounds)
   state.phase = "complete"
   state.returnPending = false
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.749535

[Killed] BooleanLiteral
HuntingRules.js:351:25
   state.wastedPounds += spoilagePounds
   state.score = Math.max(0, state.score - state.wastedPounds)
   state.phase = "complete"
-  state.returnPending = false
+  state.returnPending = true
   state.result = {
     reason: reason,
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.920884
  type: 'test'

[Killed] ArithmeticOperator
HuntingRules.js:362:15
     partyEnergyCost: energyCost,
     injury: injury,
     riskPercent: region.risk,
-    ammoUsed: state.initialAmmo - state.ammo,
+    ammoUsed: state.initialAmmo + state.ammo,
     score: state.score
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.215593
  type: 'test'

[Killed] EqualityOperator
HuntingRules.js:365:7
     ammoUsed: state.initialAmmo - state.ammo,
     score: state.score
   }
-  if (reason === "ammunition") state.message = "Out of ammunition. You return with " + state.carriedPounds + " lb"
+  if (reason !== "ammunition") state.message = "Out of ammunition. You return with " + state.carriedPounds + " lb"
   else if (reason === "carry") state.message = "Carry limit reached. You return with " + state.carriedPounds + " lb"
   else if (reason === "time") state.message = "Hunting time is over. You return with " + state.carriedPounds + " lb"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.937986
  type: 'test'

[Killed] ConditionalExpression
HuntingRules.js:365:7
     ammoUsed: state.initialAmmo - state.ammo,
     score: state.score
   }
-  if (reason === "ammunition") state.message = "Out of ammunition. You return with " + state.carriedPounds + " lb"
+  if (false) state.message = "Out of ammunition. You return with " + state.carriedPounds + " lb"
   else if (reason === "carry") state.message = "Carry limit reached. You return with " + state.carriedPounds + " lb"
   else if (reason === "time") state.message = "Hunting time is over. You return with " + state.carriedPounds + " lb"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.844512

[Killed] ConditionalExpression
HuntingRules.js:366:12
     score: state.score
   }
   if (reason === "ammunition") state.message = "Out of ammunition. You return with " + state.carriedPounds + " lb"
-  else if (reason === "carry") state.message = "Carry limit reached. You return with " + state.carriedPounds + " lb"
+  else if (true) state.message = "Carry limit reached. You return with " + state.carriedPounds + " lb"
   else if (reason === "time") state.message = "Hunting time is over. You return with " + state.carriedPounds + " lb"
   else state.message = "You return to the wagon with " + state.carriedPounds + " lb"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.415283
