[Killed] ConditionalExpression
HuntingRules.js:366:12
     score: state.score
   }
   if (reason === "ammunition") state.message = "Out of ammunition. You return with " + state.carriedPounds + " lb"
-  else if (reason === "carry") state.message = "Carry limit reached. You return with " + state.carriedPounds + " lb"
+  else if (false) state.message = "Carry limit reached. You return with " + state.carriedPounds + " lb"
   else if (reason === "time") state.message = "Hunting time is over. You return with " + state.carriedPounds + " lb"
   else state.message = "You return to the wagon with " + state.carriedPounds + " lb"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.602161

[Killed] EqualityOperator
HuntingRules.js:367:12
   }
   if (reason === "ammunition") state.message = "Out of ammunition. You return with " + state.carriedPounds + " lb"
   else if (reason === "carry") state.message = "Carry limit reached. You return with " + state.carriedPounds + " lb"
-  else if (reason === "time") state.message = "Hunting time is over. You return with " + state.carriedPounds + " lb"
+  else if (reason !== "time") state.message = "Hunting time is over. You return with " + state.carriedPounds + " lb"
   else state.message = "You return to the wagon with " + state.carriedPounds + " lb"
   state.message += injury
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.267098
  type: 'test'

[Killed] ConditionalExpression
HuntingRules.js:367:12
   }
   if (reason === "ammunition") state.message = "Out of ammunition. You return with " + state.carriedPounds + " lb"
   else if (reason === "carry") state.message = "Carry limit reached. You return with " + state.carriedPounds + " lb"
-  else if (reason === "time") state.message = "Hunting time is over. You return with " + state.carriedPounds + " lb"
+  else if (true) state.message = "Hunting time is over. You return with " + state.carriedPounds + " lb"
   else state.message = "You return to the wagon with " + state.carriedPounds + " lb"
   state.message += injury
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.533443
  type: 'test'

[Killed] AssignmentOperator
HuntingRules.js:369:3
   else if (reason === "carry") state.message = "Carry limit reached. You return with " + state.carriedPounds + " lb"
   else if (reason === "time") state.message = "Hunting time is over. You return with " + state.carriedPounds + " lb"
   else state.message = "You return to the wagon with " + state.carriedPounds + " lb"
-  state.message += injury
-    ? ". Injury occurred at a " + region.risk + "% regional risk"
-    : ". No injury at a " + region.risk + "% regional risk"
+  state.message -= injury ? ". Injury occurred at a " + region.risk + "% regional risk" : ". No injury at a " + region.risk + "% regional risk"
   return state
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.978129
  type: 'test'

[Killed] BlockStatement
HuntingRules.js:405:29
   return state
 }
 
-function advanceTick(state) {
-  if (state.phase !== "playing") return state
-  state.tick += 1
-  state.remainingTicks = Math.max(0, state.remainingTicks - 1)
-  state.cooldownTicks = Math.max(0, state.cooldownTicks - 1)
-  state.hunter.stamina = clamp(state.hunter.stamina + 1, 0, 100)
-  state.noise = clamp(state.noise - 1, 0, 100)
-  moveAnimals(state)
-  if (state.remainingTicks === 0) {
-    settle(state, "time")
-  }
-  return state
-}
+function advanceTick(state) {}
 
 function dispatch(current, action) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.092102

[Killed] ConditionalExpression
HuntingRules.js:406:7
 }
 
 function advanceTick(state) {
-  if (state.phase !== "playing") return state
+  if (false) return state
   state.tick += 1
   state.remainingTicks = Math.max(0, state.remainingTicks - 1)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.112862
  type: 'test'

[Killed] EqualityOperator
HuntingRules.js:406:7
 }
 
 function advanceTick(state) {
-  if (state.phase !== "playing") return state
+  if (state.phase === "playing") return state
   state.tick += 1
   state.remainingTicks = Math.max(0, state.remainingTicks - 1)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.426614

[Killed] AssignmentOperator
HuntingRules.js:407:3
 
 function advanceTick(state) {
   if (state.phase !== "playing") return state
-  state.tick += 1
+  state.tick -= 1
   state.remainingTicks = Math.max(0, state.remainingTicks - 1)
   state.cooldownTicks = Math.max(0, state.cooldownTicks - 1)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.546047
  type: 'test'

[Killed] ArithmeticOperator
HuntingRules.js:408:38
 function advanceTick(state) {
   if (state.phase !== "playing") return state
   state.tick += 1
-  state.remainingTicks = Math.max(0, state.remainingTicks - 1)
+  state.remainingTicks = Math.max(0, state.remainingTicks + 1)
   state.cooldownTicks = Math.max(0, state.cooldownTicks - 1)
   state.hunter.stamina = clamp(state.hunter.stamina + 1, 0, 100)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 7.618151
  type: 'test'

[Killed] MethodExpression
HuntingRules.js:408:26
 function advanceTick(state) {
   if (state.phase !== "playing") return state
   state.tick += 1
-  state.remainingTicks = Math.max(0, state.remainingTicks - 1)
+  state.remainingTicks = Math.min(0, state.remainingTicks - 1)
   state.cooldownTicks = Math.max(0, state.cooldownTicks - 1)
   state.hunter.stamina = clamp(state.hunter.stamina + 1, 0, 100)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.720892

[Killed] ArithmeticOperator
HuntingRules.js:409:37
   if (state.phase !== "playing") return state
   state.tick += 1
   state.remainingTicks = Math.max(0, state.remainingTicks - 1)
-  state.cooldownTicks = Math.max(0, state.cooldownTicks - 1)
+  state.cooldownTicks = Math.max(0, state.cooldownTicks + 1)
   state.hunter.stamina = clamp(state.hunter.stamina + 1, 0, 100)
   state.noise = clamp(state.noise - 1, 0, 100)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.105859

[Killed] MethodExpression
HuntingRules.js:409:25
   if (state.phase !== "playing") return state
   state.tick += 1
   state.remainingTicks = Math.max(0, state.remainingTicks - 1)
-  state.cooldownTicks = Math.max(0, state.cooldownTicks - 1)
+  state.cooldownTicks = Math.min(0, state.cooldownTicks - 1)
   state.hunter.stamina = clamp(state.hunter.stamina + 1, 0, 100)
   state.noise = clamp(state.noise - 1, 0, 100)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.573468

[Killed] ArithmeticOperator
HuntingRules.js:410:32
   state.tick += 1
   state.remainingTicks = Math.max(0, state.remainingTicks - 1)
   state.cooldownTicks = Math.max(0, state.cooldownTicks - 1)
-  state.hunter.stamina = clamp(state.hunter.stamina + 1, 0, 100)
+  state.hunter.stamina = clamp(state.hunter.stamina - 1, 0, 100)
   state.noise = clamp(state.noise - 1, 0, 100)
   moveAnimals(state)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.983761

[Killed] ArithmeticOperator
HuntingRules.js:411:23
   state.remainingTicks = Math.max(0, state.remainingTicks - 1)
   state.cooldownTicks = Math.max(0, state.cooldownTicks - 1)
   state.hunter.stamina = clamp(state.hunter.stamina + 1, 0, 100)
-  state.noise = clamp(state.noise - 1, 0, 100)
+  state.noise = clamp(state.noise + 1, 0, 100)
   moveAnimals(state)
   if (state.remainingTicks === 0) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.95129
  type: 'test'

[Survived] CallExpression
HuntingRules.js:412:3
   state.cooldownTicks = Math.max(0, state.cooldownTicks - 1)
   state.hunter.stamina = clamp(state.hunter.stamina + 1, 0, 100)
   state.noise = clamp(state.noise - 1, 0, 100)
-  moveAnimals(state)
+  ;
   if (state.remainingTicks === 0) {
     settle(state, "time")

[Killed] EqualityOperator
HuntingRules.js:413:7
   state.hunter.stamina = clamp(state.hunter.stamina + 1, 0, 100)
   state.noise = clamp(state.noise - 1, 0, 100)
   moveAnimals(state)
-  if (state.remainingTicks === 0) {
+  if (state.remainingTicks !== 0) {
     settle(state, "time")
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.310158
  type: 'test'

[Killed] BlockStatement
HuntingRules.js:413:35
   state.hunter.stamina = clamp(state.hunter.stamina + 1, 0, 100)
   state.noise = clamp(state.noise - 1, 0, 100)
   moveAnimals(state)
-  if (state.remainingTicks === 0) {
-    settle(state, "time")
-  }
+  if (state.remainingTicks === 0) {}
   return state
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.640262
  type: 'test'

[Killed] CallExpression
HuntingRules.js:414:5
   state.noise = clamp(state.noise - 1, 0, 100)
   moveAnimals(state)
   if (state.remainingTicks === 0) {
-    settle(state, "time")
+    ;
   }
   return state
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.157854
  type: 'test'
  ...
