[Killed] BlockStatement
JourneyRules.js:116:39
   return name === "easy" || name === "hard" ? name : "normal"
 }
 
-function canonicalRulesProfile(value) {
-  var name = String(value || "").toLowerCase()
-  return name === "classic" || name === "classic-1978" || name.indexOf("classic 1978") === 0
-    ? "classic-1978" : "omatrail"
-}
+function canonicalRulesProfile(value) {}
 
 function rulesProfileLabel(value) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.722224
  type: 'test'
  ...

[Killed] ConditionalExpression
JourneyRules.js:117:21
 }
 
 function canonicalRulesProfile(value) {
-  var name = String(value || "").toLowerCase()
+  var name = String(false).toLowerCase()
   return name === "classic" || name === "classic-1978" || name.indexOf("classic 1978") === 0
     ? "classic-1978" : "omatrail"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.239837

[Killed] LogicalOperator
JourneyRules.js:117:21
 }
 
 function canonicalRulesProfile(value) {
-  var name = String(value || "").toLowerCase()
+  var name = String(value && "").toLowerCase()
   return name === "classic" || name === "classic-1978" || name.indexOf("classic 1978") === 0
     ? "classic-1978" : "omatrail"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 17.667055
  type: 'test'
  ...

[Killed] LogicalOperator
JourneyRules.js:118:10
 
 function canonicalRulesProfile(value) {
   var name = String(value || "").toLowerCase()
-  return name === "classic" || name === "classic-1978" || name.indexOf("classic 1978") === 0
+  return (name === "classic" || name === "classic-1978") && name.indexOf("classic 1978") === 0
     ? "classic-1978" : "omatrail"
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.76887

[Killed] LogicalOperator
JourneyRules.js:118:10
 
 function canonicalRulesProfile(value) {
   var name = String(value || "").toLowerCase()
-  return name === "classic" || name === "classic-1978" || name.indexOf("classic 1978") === 0
+  return name === "classic" && name === "classic-1978" || name.indexOf("classic 1978") === 0
     ? "classic-1978" : "omatrail"
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.038944
  type: 'test'
  ...

[Killed] MethodExpression
JourneyRules.js:201:14
     phase: "store",
     seed: normalizedSeed(config.seed),
     rngState: normalizedSeed(config.seed),
-    profile: String(config.profile || "").toLowerCase().indexOf("color") === 0 ? "color" : "green",
+    profile: String(config.profile || "").toUpperCase().indexOf("color") === 0 ? "color" : "green",
     rulesProfile: rulesProfile,
     difficulty: difficulty,
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.297495

[Killed] ConditionalExpression
JourneyRules.js:201:14
     phase: "store",
     seed: normalizedSeed(config.seed),
     rngState: normalizedSeed(config.seed),
-    profile: String(config.profile || "").toLowerCase().indexOf("color") === 0 ? "color" : "green",
+    profile: true ? "color" : "green",
     rulesProfile: rulesProfile,
     difficulty: difficulty,
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.32154

[Killed] ConditionalExpression
JourneyRules.js:215:11
     region: "woodland",
     pace: "steady",
     rations: "filling",
-    cash: profileRules.startingCash === null ? occupationRules.budget : profileRules.startingCash,
+    cash: false ? occupationRules.budget : profileRules.startingCash,
     inventory: emptyInventory(),
     party: createParty(config.names, occupationRules.healthBonus),
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.115818

[Killed] EqualityOperator
JourneyRules.js:215:11
     region: "woodland",
     pace: "steady",
     rations: "filling",
-    cash: profileRules.startingCash === null ? occupationRules.budget : profileRules.startingCash,
+    cash: profileRules.startingCash !== null ? occupationRules.budget : profileRules.startingCash,
     inventory: emptyInventory(),
     party: createParty(config.names, occupationRules.healthBonus),
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 3.99433
  type: 'test'
  ...

[Killed] BlockStatement
JourneyRules.js:281:33
     + careBonus + doctorBonus - difficultyPenalty), 5, 95)
 }
 
-function minimumHuntAmmo(state) {
-  return RULE_PROFILES[canonicalRulesProfile(state && state.rulesProfile)].minimumHuntAmmo
-}
+function minimumHuntAmmo(state) {}
 
 function minimumDepartureAmmo(state) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.521913
  type: 'test'
  ...

[Killed] LogicalOperator
JourneyRules.js:282:46
 }
 
 function minimumHuntAmmo(state) {
-  return RULE_PROFILES[canonicalRulesProfile(state && state.rulesProfile)].minimumHuntAmmo
+  return RULE_PROFILES[canonicalRulesProfile(state || state.rulesProfile)].minimumHuntAmmo
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 11.611019
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:282:46
 }
 
 function minimumHuntAmmo(state) {
-  return RULE_PROFILES[canonicalRulesProfile(state && state.rulesProfile)].minimumHuntAmmo
+  return RULE_PROFILES[canonicalRulesProfile(false)].minimumHuntAmmo
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.733396
  type: 'test'
  ...

[Killed] BlockStatement
JourneyRules.js:285:38
   return RULE_PROFILES[canonicalRulesProfile(state && state.rulesProfile)].minimumHuntAmmo
 }
 
-function minimumDepartureAmmo(state) {
-  return RULE_PROFILES[canonicalRulesProfile(state && state.rulesProfile)].minimumDepartureAmmo
-}
+function minimumDepartureAmmo(state) {}
 
 function canHunt(state) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.081944
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:286:46
 }
 
 function minimumDepartureAmmo(state) {
-  return RULE_PROFILES[canonicalRulesProfile(state && state.rulesProfile)].minimumDepartureAmmo
+  return RULE_PROFILES[canonicalRulesProfile(true)].minimumDepartureAmmo
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.175126

[Killed] LogicalOperator
JourneyRules.js:286:46
 }
 
 function minimumDepartureAmmo(state) {
-  return RULE_PROFILES[canonicalRulesProfile(state && state.rulesProfile)].minimumDepartureAmmo
+  return RULE_PROFILES[canonicalRulesProfile(state || state.rulesProfile)].minimumDepartureAmmo
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.237382

[Killed] BlockStatement
JourneyRules.js:289:25
   return RULE_PROFILES[canonicalRulesProfile(state && state.rulesProfile)].minimumDepartureAmmo
 }
 
-function canHunt(state) {
-  if (!state || (state.phase !== "trail" && state.phase !== "landmark")) return false
-  if (state.inventory.ammunition < minimumHuntAmmo(state)) return false
-  return state.rulesProfile !== "classic-1978" || state.lastHuntMile !== state.miles
-}
+function canHunt(state) {}
 
 function purchaseCost(state, itemName, steps) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.612401
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:290:45
 }
 
 function canHunt(state) {
-  if (!state || (state.phase !== "trail" && state.phase !== "landmark")) return false
+  if (!state || (state.phase !== "trail" && true)) return false
   if (state.inventory.ammunition < minimumHuntAmmo(state)) return false
   return state.rulesProfile !== "classic-1978" || state.lastHuntMile !== state.miles
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 3.8548

[Killed] LogicalOperator
JourneyRules.js:290:7
 }
 
 function canHunt(state) {
-  if (!state || (state.phase !== "trail" && state.phase !== "landmark")) return false
+  if (!state && state.phase !== "trail" && state.phase !== "landmark") return false
   if (state.inventory.ammunition < minimumHuntAmmo(state)) return false
   return state.rulesProfile !== "classic-1978" || state.lastHuntMile !== state.miles
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.003608
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:291:7
 
 function canHunt(state) {
   if (!state || (state.phase !== "trail" && state.phase !== "landmark")) return false
-  if (state.inventory.ammunition < minimumHuntAmmo(state)) return false
+  if (true) return false
   return state.rulesProfile !== "classic-1978" || state.lastHuntMile !== state.miles
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.489782
  type: 'test'

[Killed] EqualityOperator
JourneyRules.js:291:7
 
 function canHunt(state) {
   if (!state || (state.phase !== "trail" && state.phase !== "landmark")) return false
-  if (state.inventory.ammunition < minimumHuntAmmo(state)) return false
+  if (state.inventory.ammunition <= minimumHuntAmmo(state)) return false
   return state.rulesProfile !== "classic-1978" || state.lastHuntMile !== state.miles
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.986696
  type: 'test'
  ...

[Killed] ConditionalExpression
JourneyRules.js:292:51
 function canHunt(state) {
   if (!state || (state.phase !== "trail" && state.phase !== "landmark")) return false
   if (state.inventory.ammunition < minimumHuntAmmo(state)) return false
-  return state.rulesProfile !== "classic-1978" || state.lastHuntMile !== state.miles
+  return state.rulesProfile !== "classic-1978" || false
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.556366
  type: 'test'
  ...

[Killed] ConditionalExpression
JourneyRules.js:292:10
 function canHunt(state) {
   if (!state || (state.phase !== "trail" && state.phase !== "landmark")) return false
   if (state.inventory.ammunition < minimumHuntAmmo(state)) return false
-  return state.rulesProfile !== "classic-1978" || state.lastHuntMile !== state.miles
+  return true
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.794138
  type: 'test'
  ...

[Killed] BooleanLiteral
JourneyRules.js:296:7
 }
 
 function purchaseCost(state, itemName, steps) {
-  if (!Object.prototype.hasOwnProperty.call(ITEMS, itemName)) return 0
+  if (Object.prototype.hasOwnProperty.call(ITEMS, itemName)) return 0
   var count = Math.max(1, Math.min(20, Math.round(finiteNumber(steps, 1))))
   var priceScale = state && state.miles > 0
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.477959

[Killed] ConditionalExpression
JourneyRules.js:296:7
 }
 
 function purchaseCost(state, itemName, steps) {
-  if (!Object.prototype.hasOwnProperty.call(ITEMS, itemName)) return 0
+  if (false) return 0
   var count = Math.max(1, Math.min(20, Math.round(finiteNumber(steps, 1))))
   var priceScale = state && state.miles > 0
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 11.172142
  type: 'test'
  ...

[Killed] MethodExpression
JourneyRules.js:297:27
 
 function purchaseCost(state, itemName, steps) {
   if (!Object.prototype.hasOwnProperty.call(ITEMS, itemName)) return 0
-  var count = Math.max(1, Math.min(20, Math.round(finiteNumber(steps, 1))))
+  var count = Math.max(1, Math.max(20, Math.round(finiteNumber(steps, 1))))
   var priceScale = state && state.miles > 0
     ? RULE_PROFILES[canonicalRulesProfile(state.rulesProfile)].fortPriceScale : 1
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.593936
  type: 'test'

[Killed] MethodExpression
JourneyRules.js:297:15
 
 function purchaseCost(state, itemName, steps) {
   if (!Object.prototype.hasOwnProperty.call(ITEMS, itemName)) return 0
-  var count = Math.max(1, Math.min(20, Math.round(finiteNumber(steps, 1))))
+  var count = Math.min(1, Math.min(20, Math.round(finiteNumber(steps, 1))))
   var priceScale = state && state.miles > 0
     ? RULE_PROFILES[canonicalRulesProfile(state.rulesProfile)].fortPriceScale : 1
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.360411
  type: 'test'

[Killed] EqualityOperator
JourneyRules.js:298:29
 function purchaseCost(state, itemName, steps) {
   if (!Object.prototype.hasOwnProperty.call(ITEMS, itemName)) return 0
   var count = Math.max(1, Math.min(20, Math.round(finiteNumber(steps, 1))))
-  var priceScale = state && state.miles > 0
+  var priceScale = state && state.miles <= 0
     ? RULE_PROFILES[canonicalRulesProfile(state.rulesProfile)].fortPriceScale : 1
   return Math.ceil(ITEMS[itemName].price * count * priceScale)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.975455

[Killed] ConditionalExpression
JourneyRules.js:298:29
 function purchaseCost(state, itemName, steps) {
   if (!Object.prototype.hasOwnProperty.call(ITEMS, itemName)) return 0
   var count = Math.max(1, Math.min(20, Math.round(finiteNumber(steps, 1))))
-  var priceScale = state && state.miles > 0
+  var priceScale = state && true
     ? RULE_PROFILES[canonicalRulesProfile(state.rulesProfile)].fortPriceScale : 1
   return Math.ceil(ITEMS[itemName].price * count * priceScale)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.449037
  type: 'test'

[Killed] ArithmeticOperator
JourneyRules.js:300:20
   var count = Math.max(1, Math.min(20, Math.round(finiteNumber(steps, 1))))
   var priceScale = state && state.miles > 0
     ? RULE_PROFILES[canonicalRulesProfile(state.rulesProfile)].fortPriceScale : 1
-  return Math.ceil(ITEMS[itemName].price * count * priceScale)
+  return Math.ceil(ITEMS[itemName].price * count / priceScale)
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.223977
  type: 'test'
  ...

[Killed] ArithmeticOperator
JourneyRules.js:300:20
   var count = Math.max(1, Math.min(20, Math.round(finiteNumber(steps, 1))))
   var priceScale = state && state.miles > 0
     ? RULE_PROFILES[canonicalRulesProfile(state.rulesProfile)].fortPriceScale : 1
-  return Math.ceil(ITEMS[itemName].price * count * priceScale)
+  return Math.ceil(ITEMS[itemName].price / count * priceScale)
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 6.461991
  type: 'test'
  ...

[Killed] BlockStatement
JourneyRules.js:380:46
   return delta
 }
 
-function ailmentTravelPenalty(state, member) {
-  if (!member || member.ailment !== "dysentery") return 0
-  var penalty = state.pace === "grueling" ? 7 : state.pace === "strenuous" ? 4 : 2
-  penalty += state.rations === "bare" ? 6 : state.rations === "meager" ? 3 : 0
-  if (["snow", "cold", "storm", "hot"].indexOf(state.weather) >= 0) penalty += 2
-  if (state.inventory.food <= 0) penalty += 6
-  if (state.difficulty === "easy") penalty -= 1
-  if (state.difficulty === "hard") penalty += 1
-  if (state.occupation === "doctor") penalty -= 2
-  return Math.max(1, penalty) * (state.rulesProfile === "classic-1978" ? 2 : 1)
-}
+function ailmentTravelPenalty(state, member) {}
 
 function updateCalendar(state, days) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.104534

[Killed] ConditionalExpression
JourneyRules.js:381:7
 }
 
 function ailmentTravelPenalty(state, member) {
-  if (!member || member.ailment !== "dysentery") return 0
+  if (true) return 0
   var penalty = state.pace === "grueling" ? 7 : state.pace === "strenuous" ? 4 : 2
   penalty += state.rations === "bare" ? 6 : state.rations === "meager" ? 3 : 0
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.933267
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:381:7
 }
 
 function ailmentTravelPenalty(state, member) {
-  if (!member || member.ailment !== "dysentery") return 0
+  if (false) return 0
   var penalty = state.pace === "grueling" ? 7 : state.pace === "strenuous" ? 4 : 2
   penalty += state.rations === "bare" ? 6 : state.rations === "meager" ? 3 : 0
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.471848
  type: 'test'

[Killed] EqualityOperator
JourneyRules.js:382:49
 
 function ailmentTravelPenalty(state, member) {
   if (!member || member.ailment !== "dysentery") return 0
-  var penalty = state.pace === "grueling" ? 7 : state.pace === "strenuous" ? 4 : 2
+  var penalty = state.pace === "grueling" ? 7 : state.pace !== "strenuous" ? 4 : 2
   penalty += state.rations === "bare" ? 6 : state.rations === "meager" ? 3 : 0
   if (["snow", "cold", "storm", "hot"].indexOf(state.weather) >= 0) penalty += 2
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.600539

[Killed] ConditionalExpression
JourneyRules.js:382:17
 
 function ailmentTravelPenalty(state, member) {
   if (!member || member.ailment !== "dysentery") return 0
-  var penalty = state.pace === "grueling" ? 7 : state.pace === "strenuous" ? 4 : 2
+  var penalty = true ? 7 : state.pace === "strenuous" ? 4 : 2
   penalty += state.rations === "bare" ? 6 : state.rations === "meager" ? 3 : 0
   if (["snow", "cold", "storm", "hot"].indexOf(state.weather) >= 0) penalty += 2
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.258582
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:383:14
 function ailmentTravelPenalty(state, member) {
   if (!member || member.ailment !== "dysentery") return 0
   var penalty = state.pace === "grueling" ? 7 : state.pace === "strenuous" ? 4 : 2
-  penalty += state.rations === "bare" ? 6 : state.rations === "meager" ? 3 : 0
+  penalty += true ? 6 : state.rations === "meager" ? 3 : 0
   if (["snow", "cold", "storm", "hot"].indexOf(state.weather) >= 0) penalty += 2
   if (state.inventory.food <= 0) penalty += 6
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.071314

[Killed] EqualityOperator
JourneyRules.js:383:45
 function ailmentTravelPenalty(state, member) {
   if (!member || member.ailment !== "dysentery") return 0
   var penalty = state.pace === "grueling" ? 7 : state.pace === "strenuous" ? 4 : 2
-  penalty += state.rations === "bare" ? 6 : state.rations === "meager" ? 3 : 0
+  penalty += state.rations === "bare" ? 6 : state.rations !== "meager" ? 3 : 0
   if (["snow", "cold", "storm", "hot"].indexOf(state.weather) >= 0) penalty += 2
   if (state.inventory.food <= 0) penalty += 6
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.679073
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:384:7
   if (!member || member.ailment !== "dysentery") return 0
   var penalty = state.pace === "grueling" ? 7 : state.pace === "strenuous" ? 4 : 2
   penalty += state.rations === "bare" ? 6 : state.rations === "meager" ? 3 : 0
-  if (["snow", "cold", "storm", "hot"].indexOf(state.weather) >= 0) penalty += 2
+  if (true) penalty += 2
   if (state.inventory.food <= 0) penalty += 6
   if (state.difficulty === "easy") penalty -= 1
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.835655

[Killed] ConditionalExpression
JourneyRules.js:384:7
   if (!member || member.ailment !== "dysentery") return 0
   var penalty = state.pace === "grueling" ? 7 : state.pace === "strenuous" ? 4 : 2
   penalty += state.rations === "bare" ? 6 : state.rations === "meager" ? 3 : 0
-  if (["snow", "cold", "storm", "hot"].indexOf(state.weather) >= 0) penalty += 2
+  if (false) penalty += 2
   if (state.inventory.food <= 0) penalty += 6
   if (state.difficulty === "easy") penalty -= 1
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.885568
  type: 'test'
  ...

[Killed] AssignmentOperator
JourneyRules.js:385:34
   var penalty = state.pace === "grueling" ? 7 : state.pace === "strenuous" ? 4 : 2
   penalty += state.rations === "bare" ? 6 : state.rations === "meager" ? 3 : 0
   if (["snow", "cold", "storm", "hot"].indexOf(state.weather) >= 0) penalty += 2
-  if (state.inventory.food <= 0) penalty += 6
+  if (state.inventory.food <= 0) penalty -= 6
   if (state.difficulty === "easy") penalty -= 1
   if (state.difficulty === "hard") penalty += 1
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.858759

[Killed] EqualityOperator
JourneyRules.js:385:7
   var penalty = state.pace === "grueling" ? 7 : state.pace === "strenuous" ? 4 : 2
   penalty += state.rations === "bare" ? 6 : state.rations === "meager" ? 3 : 0
   if (["snow", "cold", "storm", "hot"].indexOf(state.weather) >= 0) penalty += 2
-  if (state.inventory.food <= 0) penalty += 6
+  if (state.inventory.food > 0) penalty += 6
   if (state.difficulty === "easy") penalty -= 1
   if (state.difficulty === "hard") penalty += 1
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.691267
  type: 'test'

[Killed] EqualityOperator
JourneyRules.js:386:7
   penalty += state.rations === "bare" ? 6 : state.rations === "meager" ? 3 : 0
   if (["snow", "cold", "storm", "hot"].indexOf(state.weather) >= 0) penalty += 2
   if (state.inventory.food <= 0) penalty += 6
-  if (state.difficulty === "easy") penalty -= 1
+  if (state.difficulty !== "easy") penalty -= 1
   if (state.difficulty === "hard") penalty += 1
   if (state.occupation === "doctor") penalty -= 2
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.102121

[Killed] ConditionalExpression
JourneyRules.js:386:7
   penalty += state.rations === "bare" ? 6 : state.rations === "meager" ? 3 : 0
   if (["snow", "cold", "storm", "hot"].indexOf(state.weather) >= 0) penalty += 2
   if (state.inventory.food <= 0) penalty += 6
-  if (state.difficulty === "easy") penalty -= 1
+  if (true) penalty -= 1
   if (state.difficulty === "hard") penalty += 1
   if (state.occupation === "doctor") penalty -= 2
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.363026

[Killed] ConditionalExpression
JourneyRules.js:387:7
   if (["snow", "cold", "storm", "hot"].indexOf(state.weather) >= 0) penalty += 2
   if (state.inventory.food <= 0) penalty += 6
   if (state.difficulty === "easy") penalty -= 1
-  if (state.difficulty === "hard") penalty += 1
+  if (true) penalty += 1
   if (state.occupation === "doctor") penalty -= 2
   return Math.max(1, penalty) * (state.rulesProfile === "classic-1978" ? 2 : 1)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.875278
  type: 'test'
  ...

[Killed] EqualityOperator
JourneyRules.js:387:7
   if (["snow", "cold", "storm", "hot"].indexOf(state.weather) >= 0) penalty += 2
   if (state.inventory.food <= 0) penalty += 6
   if (state.difficulty === "easy") penalty -= 1
-  if (state.difficulty === "hard") penalty += 1
+  if (state.difficulty !== "hard") penalty += 1
   if (state.occupation === "doctor") penalty -= 2
   return Math.max(1, penalty) * (state.rulesProfile === "classic-1978" ? 2 : 1)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.468833
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:388:7
   if (state.inventory.food <= 0) penalty += 6
   if (state.difficulty === "easy") penalty -= 1
   if (state.difficulty === "hard") penalty += 1
-  if (state.occupation === "doctor") penalty -= 2
+  if (true) penalty -= 2
   return Math.max(1, penalty) * (state.rulesProfile === "classic-1978" ? 2 : 1)
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 6.193281
  type: 'test'

[Killed] EqualityOperator
JourneyRules.js:388:7
   if (state.inventory.food <= 0) penalty += 6
   if (state.difficulty === "easy") penalty -= 1
   if (state.difficulty === "hard") penalty += 1
-  if (state.occupation === "doctor") penalty -= 2
+  if (state.occupation !== "doctor") penalty -= 2
   return Math.max(1, penalty) * (state.rulesProfile === "classic-1978" ? 2 : 1)
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.946572
