[Killed] EqualityOperator
JourneyRules.js:389:34
   if (state.difficulty === "easy") penalty -= 1
   if (state.difficulty === "hard") penalty += 1
   if (state.occupation === "doctor") penalty -= 2
-  return Math.max(1, penalty) * (state.rulesProfile === "classic-1978" ? 2 : 1)
+  return Math.max(1, penalty) * (state.rulesProfile !== "classic-1978" ? 2 : 1)
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.207046

[Killed] ConditionalExpression
JourneyRules.js:389:34
   if (state.difficulty === "easy") penalty -= 1
   if (state.difficulty === "hard") penalty += 1
   if (state.occupation === "doctor") penalty -= 2
-  return Math.max(1, penalty) * (state.rulesProfile === "classic-1978" ? 2 : 1)
+  return Math.max(1, penalty) * (false ? 2 : 1)
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.178783

[Killed] BlockStatement
JourneyRules.js:405:40
   return state
 }
 
-function applyPartyTravel(state, days) {
-  var alive = livingParty(state)
-  var classicRations = state.rations === "bare" ? 13 : state.rations === "meager" ? 18 : 23
-  var neededFood = state.rulesProfile === "classic-1978"
-    ? Math.ceil(classicRations * alive / 5) : alive * foodPerPerson(state.rations) * days
-  var pressureScale = state.rulesProfile === "classic-1978" ? Math.max(1, Math.round(days / 7)) : 1
-  state.inventory.food = Math.max(0, state.inventory.food - neededFood)
-  state.party.forEach(function(member) {
-    if (!member.alive) return
-    member.health = clamp(member.health + healthDelta(state, member) * pressureScale
-      - ailmentTravelPenalty(state, member), 0, 100)
-    member.fatigue = clamp(member.fatigue
-      + (state.pace === "steady" ? 3 : state.pace === "strenuous" ? 7 : 12) * pressureScale, 0, 100)
-    member.morale = clamp(member.morale + (state.rations === "filling" ? 1 : -2) * pressureScale, 0, 100)
-    updateMemberCondition(state, member, member.ailment || "illness and exhaustion")
-  })
-  return state
-}
+function applyPartyTravel(state, days) {}
 
 function eventEligible(state, event) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.341435
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:407:56
 
 function applyPartyTravel(state, days) {
   var alive = livingParty(state)
-  var classicRations = state.rations === "bare" ? 13 : state.rations === "meager" ? 18 : 23
+  var classicRations = state.rations === "bare" ? 13 : true ? 18 : 23
   var neededFood = state.rulesProfile === "classic-1978"
     ? Math.ceil(classicRations * alive / 5) : alive * foodPerPerson(state.rations) * days
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.194263

[Killed] EqualityOperator
JourneyRules.js:407:56
 
 function applyPartyTravel(state, days) {
   var alive = livingParty(state)
-  var classicRations = state.rations === "bare" ? 13 : state.rations === "meager" ? 18 : 23
+  var classicRations = state.rations === "bare" ? 13 : state.rations !== "meager" ? 18 : 23
   var neededFood = state.rulesProfile === "classic-1978"
     ? Math.ceil(classicRations * alive / 5) : alive * foodPerPerson(state.rations) * days
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.05322
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:408:20
 function applyPartyTravel(state, days) {
   var alive = livingParty(state)
   var classicRations = state.rations === "bare" ? 13 : state.rations === "meager" ? 18 : 23
-  var neededFood = state.rulesProfile === "classic-1978"
+  var neededFood = true
     ? Math.ceil(classicRations * alive / 5) : alive * foodPerPerson(state.rations) * days
   var pressureScale = state.rulesProfile === "classic-1978" ? Math.max(1, Math.round(days / 7)) : 1
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.498497

[Killed] EqualityOperator
JourneyRules.js:408:20
 function applyPartyTravel(state, days) {
   var alive = livingParty(state)
   var classicRations = state.rations === "bare" ? 13 : state.rations === "meager" ? 18 : 23
-  var neededFood = state.rulesProfile === "classic-1978"
+  var neededFood = state.rulesProfile !== "classic-1978"
     ? Math.ceil(classicRations * alive / 5) : alive * foodPerPerson(state.rations) * days
   var pressureScale = state.rulesProfile === "classic-1978" ? Math.max(1, Math.round(days / 7)) : 1
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.442654

[Killed] ArithmeticOperator
JourneyRules.js:409:17
   var alive = livingParty(state)
   var classicRations = state.rations === "bare" ? 13 : state.rations === "meager" ? 18 : 23
   var neededFood = state.rulesProfile === "classic-1978"
-    ? Math.ceil(classicRations * alive / 5) : alive * foodPerPerson(state.rations) * days
+    ? Math.ceil(classicRations / alive / 5) : alive * foodPerPerson(state.rations) * days
   var pressureScale = state.rulesProfile === "classic-1978" ? Math.max(1, Math.round(days / 7)) : 1
   state.inventory.food = Math.max(0, state.inventory.food - neededFood)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.134942
  type: 'test'

[Killed] ArithmeticOperator
JourneyRules.js:409:17
   var alive = livingParty(state)
   var classicRations = state.rations === "bare" ? 13 : state.rations === "meager" ? 18 : 23
   var neededFood = state.rulesProfile === "classic-1978"
-    ? Math.ceil(classicRations * alive / 5) : alive * foodPerPerson(state.rations) * days
+    ? Math.ceil(classicRations * alive * 5) : alive * foodPerPerson(state.rations) * days
   var pressureScale = state.rulesProfile === "classic-1978" ? Math.max(1, Math.round(days / 7)) : 1
   state.inventory.food = Math.max(0, state.inventory.food - neededFood)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.130093
  type: 'test'

[Killed] MethodExpression
JourneyRules.js:410:63
   var classicRations = state.rations === "bare" ? 13 : state.rations === "meager" ? 18 : 23
   var neededFood = state.rulesProfile === "classic-1978"
     ? Math.ceil(classicRations * alive / 5) : alive * foodPerPerson(state.rations) * days
-  var pressureScale = state.rulesProfile === "classic-1978" ? Math.max(1, Math.round(days / 7)) : 1
+  var pressureScale = state.rulesProfile === "classic-1978" ? Math.min(1, Math.round(days / 7)) : 1
   state.inventory.food = Math.max(0, state.inventory.food - neededFood)
   state.party.forEach(function(member) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.244015
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:410:23
   var classicRations = state.rations === "bare" ? 13 : state.rations === "meager" ? 18 : 23
   var neededFood = state.rulesProfile === "classic-1978"
     ? Math.ceil(classicRations * alive / 5) : alive * foodPerPerson(state.rations) * days
-  var pressureScale = state.rulesProfile === "classic-1978" ? Math.max(1, Math.round(days / 7)) : 1
+  var pressureScale = false ? Math.max(1, Math.round(days / 7)) : 1
   state.inventory.food = Math.max(0, state.inventory.food - neededFood)
   state.party.forEach(function(member) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.194963

[Killed] MethodExpression
JourneyRules.js:411:26
   var neededFood = state.rulesProfile === "classic-1978"
     ? Math.ceil(classicRations * alive / 5) : alive * foodPerPerson(state.rations) * days
   var pressureScale = state.rulesProfile === "classic-1978" ? Math.max(1, Math.round(days / 7)) : 1
-  state.inventory.food = Math.max(0, state.inventory.food - neededFood)
+  state.inventory.food = Math.min(0, state.inventory.food - neededFood)
   state.party.forEach(function(member) {
     if (!member.alive) return
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.232904
  type: 'test'

[Killed] ArithmeticOperator
JourneyRules.js:411:38
   var neededFood = state.rulesProfile === "classic-1978"
     ? Math.ceil(classicRations * alive / 5) : alive * foodPerPerson(state.rations) * days
   var pressureScale = state.rulesProfile === "classic-1978" ? Math.max(1, Math.round(days / 7)) : 1
-  state.inventory.food = Math.max(0, state.inventory.food - neededFood)
+  state.inventory.food = Math.max(0, state.inventory.food + neededFood)
   state.party.forEach(function(member) {
     if (!member.alive) return
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.680567

[Killed] BlockStatement
JourneyRules.js:412:40
     ? Math.ceil(classicRations * alive / 5) : alive * foodPerPerson(state.rations) * days
   var pressureScale = state.rulesProfile === "classic-1978" ? Math.max(1, Math.round(days / 7)) : 1
   state.inventory.food = Math.max(0, state.inventory.food - neededFood)
-  state.party.forEach(function(member) {
-    if (!member.alive) return
-    member.health = clamp(member.health + healthDelta(state, member) * pressureScale
-      - ailmentTravelPenalty(state, member), 0, 100)
-    member.fatigue = clamp(member.fatigue
-      + (state.pace === "steady" ? 3 : state.pace === "strenuous" ? 7 : 12) * pressureScale, 0, 100)
-    member.morale = clamp(member.morale + (state.rations === "filling" ? 1 : -2) * pressureScale, 0, 100)
-    updateMemberCondition(state, member, member.ailment || "illness and exhaustion")
-  })
+  state.party.forEach(function(member) {})
   return state
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 7.468553
  type: 'test'

[Killed] BooleanLiteral
JourneyRules.js:413:9
   var pressureScale = state.rulesProfile === "classic-1978" ? Math.max(1, Math.round(days / 7)) : 1
   state.inventory.food = Math.max(0, state.inventory.food - neededFood)
   state.party.forEach(function(member) {
-    if (!member.alive) return
+    if (member.alive) return
     member.health = clamp(member.health + healthDelta(state, member) * pressureScale
       - ailmentTravelPenalty(state, member), 0, 100)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.47255
  type: 'test'
  ...

[Killed] ConditionalExpression
JourneyRules.js:413:9
   var pressureScale = state.rulesProfile === "classic-1978" ? Math.max(1, Math.round(days / 7)) : 1
   state.inventory.food = Math.max(0, state.inventory.food - neededFood)
   state.party.forEach(function(member) {
-    if (!member.alive) return
+    if (true) return
     member.health = clamp(member.health + healthDelta(state, member) * pressureScale
       - ailmentTravelPenalty(state, member), 0, 100)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.41288

[Killed] ArithmeticOperator
JourneyRules.js:414:27
   state.inventory.food = Math.max(0, state.inventory.food - neededFood)
   state.party.forEach(function(member) {
     if (!member.alive) return
-    member.health = clamp(member.health + healthDelta(state, member) * pressureScale
-      - ailmentTravelPenalty(state, member), 0, 100)
+    member.health = clamp(member.health + healthDelta(state, member) * pressureScale + ailmentTravelPenalty(state, member), 0, 100)
     member.fatigue = clamp(member.fatigue
       + (state.pace === "steady" ? 3 : state.pace === "strenuous" ? 7 : 12) * pressureScale, 0, 100)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 3.959285

[Killed] ArithmeticOperator
JourneyRules.js:414:43
   state.inventory.food = Math.max(0, state.inventory.food - neededFood)
   state.party.forEach(function(member) {
     if (!member.alive) return
-    member.health = clamp(member.health + healthDelta(state, member) * pressureScale
+    member.health = clamp(member.health + healthDelta(state, member) / pressureScale
       - ailmentTravelPenalty(state, member), 0, 100)
     member.fatigue = clamp(member.fatigue
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.346475

[Killed] ArithmeticOperator
JourneyRules.js:416:28
     if (!member.alive) return
     member.health = clamp(member.health + healthDelta(state, member) * pressureScale
       - ailmentTravelPenalty(state, member), 0, 100)
-    member.fatigue = clamp(member.fatigue
-      + (state.pace === "steady" ? 3 : state.pace === "strenuous" ? 7 : 12) * pressureScale, 0, 100)
+    member.fatigue = clamp(member.fatigue - (state.pace === "steady" ? 3 : state.pace === "strenuous" ? 7 : 12) * pressureScale, 0, 100)
     member.morale = clamp(member.morale + (state.rations === "filling" ? 1 : -2) * pressureScale, 0, 100)
     updateMemberCondition(state, member, member.ailment || "illness and exhaustion")
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.427766

[Killed] EqualityOperator
JourneyRules.js:417:10
     member.health = clamp(member.health + healthDelta(state, member) * pressureScale
       - ailmentTravelPenalty(state, member), 0, 100)
     member.fatigue = clamp(member.fatigue
-      + (state.pace === "steady" ? 3 : state.pace === "strenuous" ? 7 : 12) * pressureScale, 0, 100)
+      + (state.pace !== "steady" ? 3 : state.pace === "strenuous" ? 7 : 12) * pressureScale, 0, 100)
     member.morale = clamp(member.morale + (state.rations === "filling" ? 1 : -2) * pressureScale, 0, 100)
     updateMemberCondition(state, member, member.ailment || "illness and exhaustion")
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 7.707016
  type: 'test'

[Killed] ArithmeticOperator
JourneyRules.js:417:9
     member.health = clamp(member.health + healthDelta(state, member) * pressureScale
       - ailmentTravelPenalty(state, member), 0, 100)
     member.fatigue = clamp(member.fatigue
-      + (state.pace === "steady" ? 3 : state.pace === "strenuous" ? 7 : 12) * pressureScale, 0, 100)
+      + (state.pace === "steady" ? 3 : state.pace === "strenuous" ? 7 : 12) / pressureScale, 0, 100)
     member.morale = clamp(member.morale + (state.rations === "filling" ? 1 : -2) * pressureScale, 0, 100)
     updateMemberCondition(state, member, member.ailment || "illness and exhaustion")
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.468193
  type: 'test'

[Killed] ArithmeticOperator
JourneyRules.js:418:27
       - ailmentTravelPenalty(state, member), 0, 100)
     member.fatigue = clamp(member.fatigue
       + (state.pace === "steady" ? 3 : state.pace === "strenuous" ? 7 : 12) * pressureScale, 0, 100)
-    member.morale = clamp(member.morale + (state.rations === "filling" ? 1 : -2) * pressureScale, 0, 100)
+    member.morale = clamp(member.morale - (state.rations === "filling" ? 1 : -2) * pressureScale, 0, 100)
     updateMemberCondition(state, member, member.ailment || "illness and exhaustion")
   })
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.489392

[Killed] EqualityOperator
JourneyRules.js:418:44
       - ailmentTravelPenalty(state, member), 0, 100)
     member.fatigue = clamp(member.fatigue
       + (state.pace === "steady" ? 3 : state.pace === "strenuous" ? 7 : 12) * pressureScale, 0, 100)
-    member.morale = clamp(member.morale + (state.rations === "filling" ? 1 : -2) * pressureScale, 0, 100)
+    member.morale = clamp(member.morale + (state.rations !== "filling" ? 1 : -2) * pressureScale, 0, 100)
     updateMemberCondition(state, member, member.ailment || "illness and exhaustion")
   })
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.362385
  type: 'test'

[Survived] ConditionalExpression
JourneyRules.js:419:42
     member.fatigue = clamp(member.fatigue
       + (state.pace === "steady" ? 3 : state.pace === "strenuous" ? 7 : 12) * pressureScale, 0, 100)
     member.morale = clamp(member.morale + (state.rations === "filling" ? 1 : -2) * pressureScale, 0, 100)
-    updateMemberCondition(state, member, member.ailment || "illness and exhaustion")
+    updateMemberCondition(state, member, false)
   })
   return state

[Survived] ConditionalExpression
JourneyRules.js:419:42
     member.fatigue = clamp(member.fatigue
       + (state.pace === "steady" ? 3 : state.pace === "strenuous" ? 7 : 12) * pressureScale, 0, 100)
     member.morale = clamp(member.morale + (state.rations === "filling" ? 1 : -2) * pressureScale, 0, 100)
-    updateMemberCondition(state, member, member.ailment || "illness and exhaustion")
+    updateMemberCondition(state, member, true)
   })
   return state

[Killed] BlockStatement
JourneyRules.js:442:29
   return true
 }
 
-function chooseEvent(state) {
-  var eligible = EVENTS.filter(function(event) { return eventEligible(state, event) })
-  if (!eligible.length) return null
-  var chance = draw(state.rngState)
-  state.rngState = chance.seed
-  var eventChance = state.difficulty === "easy" ? 0.22 : state.difficulty === "hard" ? 0.38 : 0.30
-  if (state.rulesProfile === "classic-1978") eventChance = state.difficulty === "easy" ? 0.48 : state.difficulty === "hard" ? 0.68 : 0.58
-  if (chance.value >= eventChance) return null
-  var selection = draw(state.rngState)
-  state.rngState = selection.seed
-  var weights = state.rulesProfile === "classic-1978"
-    ? { illness: 16, breakdown: 18, weather: 20, trade: 8, aid: 6, conflict: 10, injury: 16, landmark: 6 }
-    : { illness: 1, breakdown: 1, weather: 1, trade: 1, aid: 1, conflict: 1, injury: 1, landmark: 1 }
-  var categoryCounts = {}
-  eligible.forEach(function(event) { categoryCounts[event.category] = (categoryCounts[event.category] || 0) + 1 })
-  var categories = Object.keys(categoryCounts)
-  var totalWeight = categories.reduce(function(total, category) { return total + weights[category] }, 0)
-  var weightedRoll = selection.value * totalWeight
-  for (var index = 0; index < eligible.length; index++) {
-    weightedRoll -= weights[eligible[index].category] / categoryCounts[eligible[index].category]
-    if (weightedRoll < 0) return clone(eligible[index])
-  }
-  return clone(eligible[eligible.length - 1])
-}
+function chooseEvent(state) {}
 
 function arriveAtTarget(state) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.113793

[Killed] BlockStatement
JourneyRules.js:443:48
 }
 
 function chooseEvent(state) {
-  var eligible = EVENTS.filter(function(event) { return eventEligible(state, event) })
+  var eligible = EVENTS.filter(function(event) {})
   if (!eligible.length) return null
   var chance = draw(state.rngState)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.212106

[Survived] MethodExpression
JourneyRules.js:443:18
 }
 
 function chooseEvent(state) {
-  var eligible = EVENTS.filter(function(event) { return eventEligible(state, event) })
+  var eligible = EVENTS
   if (!eligible.length) return null
   var chance = draw(state.rngState)

[Killed] ConditionalExpression
JourneyRules.js:444:7
 
 function chooseEvent(state) {
   var eligible = EVENTS.filter(function(event) { return eventEligible(state, event) })
-  if (!eligible.length) return null
+  if (true) return null
   var chance = draw(state.rngState)
   state.rngState = chance.seed
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.794899

[Killed] BooleanLiteral
JourneyRules.js:444:7
 
 function chooseEvent(state) {
   var eligible = EVENTS.filter(function(event) { return eventEligible(state, event) })
-  if (!eligible.length) return null
+  if (eligible.length) return null
   var chance = draw(state.rngState)
   state.rngState = chance.seed
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.787946

[Killed] ConditionalExpression
JourneyRules.js:447:58
   if (!eligible.length) return null
   var chance = draw(state.rngState)
   state.rngState = chance.seed
-  var eventChance = state.difficulty === "easy" ? 0.22 : state.difficulty === "hard" ? 0.38 : 0.30
+  var eventChance = state.difficulty === "easy" ? 0.22 : true ? 0.38 : 0.30
   if (state.rulesProfile === "classic-1978") eventChance = state.difficulty === "easy" ? 0.48 : state.difficulty === "hard" ? 0.68 : 0.58
   if (chance.value >= eventChance) return null
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.891299

[Killed] ConditionalExpression
JourneyRules.js:447:21
   if (!eligible.length) return null
   var chance = draw(state.rngState)
   state.rngState = chance.seed
-  var eventChance = state.difficulty === "easy" ? 0.22 : state.difficulty === "hard" ? 0.38 : 0.30
+  var eventChance = true ? 0.22 : state.difficulty === "hard" ? 0.38 : 0.30
   if (state.rulesProfile === "classic-1978") eventChance = state.difficulty === "easy" ? 0.48 : state.difficulty === "hard" ? 0.68 : 0.58
   if (chance.value >= eventChance) return null
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.846405
  type: 'test'

[Killed] EqualityOperator
JourneyRules.js:448:97
   var chance = draw(state.rngState)
   state.rngState = chance.seed
   var eventChance = state.difficulty === "easy" ? 0.22 : state.difficulty === "hard" ? 0.38 : 0.30
-  if (state.rulesProfile === "classic-1978") eventChance = state.difficulty === "easy" ? 0.48 : state.difficulty === "hard" ? 0.68 : 0.58
+  if (state.rulesProfile === "classic-1978") eventChance = state.difficulty === "easy" ? 0.48 : state.difficulty !== "hard" ? 0.68 : 0.58
   if (chance.value >= eventChance) return null
   var selection = draw(state.rngState)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.687019
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:448:7
   var chance = draw(state.rngState)
   state.rngState = chance.seed
   var eventChance = state.difficulty === "easy" ? 0.22 : state.difficulty === "hard" ? 0.38 : 0.30
-  if (state.rulesProfile === "classic-1978") eventChance = state.difficulty === "easy" ? 0.48 : state.difficulty === "hard" ? 0.68 : 0.58
+  if (false) eventChance = state.difficulty === "easy" ? 0.48 : state.difficulty === "hard" ? 0.68 : 0.58
   if (chance.value >= eventChance) return null
   var selection = draw(state.rngState)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.527742
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:449:7
   state.rngState = chance.seed
   var eventChance = state.difficulty === "easy" ? 0.22 : state.difficulty === "hard" ? 0.38 : 0.30
   if (state.rulesProfile === "classic-1978") eventChance = state.difficulty === "easy" ? 0.48 : state.difficulty === "hard" ? 0.68 : 0.58
-  if (chance.value >= eventChance) return null
+  if (false) return null
   var selection = draw(state.rngState)
   state.rngState = selection.seed
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 3.898673

[Killed] ConditionalExpression
JourneyRules.js:449:7
   state.rngState = chance.seed
   var eventChance = state.difficulty === "easy" ? 0.22 : state.difficulty === "hard" ? 0.38 : 0.30
   if (state.rulesProfile === "classic-1978") eventChance = state.difficulty === "easy" ? 0.48 : state.difficulty === "hard" ? 0.68 : 0.58
-  if (chance.value >= eventChance) return null
+  if (true) return null
   var selection = draw(state.rngState)
   state.rngState = selection.seed
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.366684
  type: 'test'
  ...

[Killed] EqualityOperator
JourneyRules.js:452:17
   if (chance.value >= eventChance) return null
   var selection = draw(state.rngState)
   state.rngState = selection.seed
-  var weights = state.rulesProfile === "classic-1978"
+  var weights = state.rulesProfile !== "classic-1978"
     ? { illness: 16, breakdown: 18, weather: 20, trade: 8, aid: 6, conflict: 10, injury: 16, landmark: 6 }
     : { illness: 1, breakdown: 1, weather: 1, trade: 1, aid: 1, conflict: 1, injury: 1, landmark: 1 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.281195
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:452:17
   if (chance.value >= eventChance) return null
   var selection = draw(state.rngState)
   state.rngState = selection.seed
-  var weights = state.rulesProfile === "classic-1978"
+  var weights = false
     ? { illness: 16, breakdown: 18, weather: 20, trade: 8, aid: 6, conflict: 10, injury: 16, landmark: 6 }
     : { illness: 1, breakdown: 1, weather: 1, trade: 1, aid: 1, conflict: 1, injury: 1, landmark: 1 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.661931

[Killed] ConditionalExpression
JourneyRules.js:456:72
     ? { illness: 16, breakdown: 18, weather: 20, trade: 8, aid: 6, conflict: 10, injury: 16, landmark: 6 }
     : { illness: 1, breakdown: 1, weather: 1, trade: 1, aid: 1, conflict: 1, injury: 1, landmark: 1 }
   var categoryCounts = {}
-  eligible.forEach(function(event) { categoryCounts[event.category] = (categoryCounts[event.category] || 0) + 1 })
+  eligible.forEach(function(event) { categoryCounts[event.category] = (true) + 1 })
   var categories = Object.keys(categoryCounts)
   var totalWeight = categories.reduce(function(total, category) { return total + weights[category] }, 0)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 10.559042
