[Killed] LogicalOperator
JourneyRules.js:456:72
     ? { illness: 16, breakdown: 18, weather: 20, trade: 8, aid: 6, conflict: 10, injury: 16, landmark: 6 }
     : { illness: 1, breakdown: 1, weather: 1, trade: 1, aid: 1, conflict: 1, injury: 1, landmark: 1 }
   var categoryCounts = {}
-  eligible.forEach(function(event) { categoryCounts[event.category] = (categoryCounts[event.category] || 0) + 1 })
+  eligible.forEach(function(event) { categoryCounts[event.category] = (categoryCounts[event.category] && 0) + 1 })
   var categories = Object.keys(categoryCounts)
   var totalWeight = categories.reduce(function(total, category) { return total + weights[category] }, 0)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 42.906846

[Killed] ArithmeticOperator
JourneyRules.js:458:74
   var categoryCounts = {}
   eligible.forEach(function(event) { categoryCounts[event.category] = (categoryCounts[event.category] || 0) + 1 })
   var categories = Object.keys(categoryCounts)
-  var totalWeight = categories.reduce(function(total, category) { return total + weights[category] }, 0)
+  var totalWeight = categories.reduce(function(total, category) { return total - weights[category] }, 0)
   var weightedRoll = selection.value * totalWeight
   for (var index = 0; index < eligible.length; index++) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 7.198992

[Killed] BlockStatement
JourneyRules.js:458:65
   var categoryCounts = {}
   eligible.forEach(function(event) { categoryCounts[event.category] = (categoryCounts[event.category] || 0) + 1 })
   var categories = Object.keys(categoryCounts)
-  var totalWeight = categories.reduce(function(total, category) { return total + weights[category] }, 0)
+  var totalWeight = categories.reduce(function(total, category) {}, 0)
   var weightedRoll = selection.value * totalWeight
   for (var index = 0; index < eligible.length; index++) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.980736

[Killed] ArithmeticOperator
JourneyRules.js:459:22
   eligible.forEach(function(event) { categoryCounts[event.category] = (categoryCounts[event.category] || 0) + 1 })
   var categories = Object.keys(categoryCounts)
   var totalWeight = categories.reduce(function(total, category) { return total + weights[category] }, 0)
-  var weightedRoll = selection.value * totalWeight
+  var weightedRoll = selection.value / totalWeight
   for (var index = 0; index < eligible.length; index++) {
     weightedRoll -= weights[eligible[index].category] / categoryCounts[eligible[index].category]
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 9.534035
  type: 'test'

[Killed] EqualityOperator
JourneyRules.js:460:23
   var categories = Object.keys(categoryCounts)
   var totalWeight = categories.reduce(function(total, category) { return total + weights[category] }, 0)
   var weightedRoll = selection.value * totalWeight
-  for (var index = 0; index < eligible.length; index++) {
+  for (var index = 0; index >= eligible.length; index++) {
     weightedRoll -= weights[eligible[index].category] / categoryCounts[eligible[index].category]
     if (weightedRoll < 0) return clone(eligible[index])
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.831959

[Killed] UpdateOperator
JourneyRules.js:460:48
   var categories = Object.keys(categoryCounts)
   var totalWeight = categories.reduce(function(total, category) { return total + weights[category] }, 0)
   var weightedRoll = selection.value * totalWeight
-  for (var index = 0; index < eligible.length; index++) {
+  for (var index = 0; index < eligible.length; index--) {
     weightedRoll -= weights[eligible[index].category] / categoryCounts[eligible[index].category]
     if (weightedRoll < 0) return clone(eligible[index])
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.429199
  type: 'test'

[Killed] AssignmentOperator
JourneyRules.js:461:5
   var totalWeight = categories.reduce(function(total, category) { return total + weights[category] }, 0)
   var weightedRoll = selection.value * totalWeight
   for (var index = 0; index < eligible.length; index++) {
-    weightedRoll -= weights[eligible[index].category] / categoryCounts[eligible[index].category]
+    weightedRoll += weights[eligible[index].category] / categoryCounts[eligible[index].category]
     if (weightedRoll < 0) return clone(eligible[index])
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.788018

[Killed] ArithmeticOperator
JourneyRules.js:461:21
   var totalWeight = categories.reduce(function(total, category) { return total + weights[category] }, 0)
   var weightedRoll = selection.value * totalWeight
   for (var index = 0; index < eligible.length; index++) {
-    weightedRoll -= weights[eligible[index].category] / categoryCounts[eligible[index].category]
+    weightedRoll -= weights[eligible[index].category] * categoryCounts[eligible[index].category]
     if (weightedRoll < 0) return clone(eligible[index])
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.275973
  type: 'test'

[Killed] EqualityOperator
JourneyRules.js:462:9
   var weightedRoll = selection.value * totalWeight
   for (var index = 0; index < eligible.length; index++) {
     weightedRoll -= weights[eligible[index].category] / categoryCounts[eligible[index].category]
-    if (weightedRoll < 0) return clone(eligible[index])
+    if (weightedRoll >= 0) return clone(eligible[index])
   }
   return clone(eligible[eligible.length - 1])
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.552347
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:462:9
   var weightedRoll = selection.value * totalWeight
   for (var index = 0; index < eligible.length; index++) {
     weightedRoll -= weights[eligible[index].category] / categoryCounts[eligible[index].category]
-    if (weightedRoll < 0) return clone(eligible[index])
+    if (true) return clone(eligible[index])
   }
   return clone(eligible[eligible.length - 1])
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.755847
  type: 'test'

[Survived] ArithmeticOperator
JourneyRules.js:464:25
     weightedRoll -= weights[eligible[index].category] / categoryCounts[eligible[index].category]
     if (weightedRoll < 0) return clone(eligible[index])
   }
-  return clone(eligible[eligible.length - 1])
+  return clone(eligible[eligible.length + 1])
 }
 

[Killed] ConditionalExpression
JourneyRules.js:485:7
 }
 
 function travel(state) {
-  if (state.phase !== "trail") return state
+  if (true) return state
   if (livingParty(state) === 0) return finishJourney(state, "loss")
   if (state.inventory.oxen < 2 || state.wagonCondition <= 0) return finishJourney(state, "loss")
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.60756
  type: 'test'

[Killed] EqualityOperator
JourneyRules.js:485:7
 }
 
 function travel(state) {
-  if (state.phase !== "trail") return state
+  if (state.phase === "trail") return state
   if (livingParty(state) === 0) return finishJourney(state, "loss")
   if (state.inventory.oxen < 2 || state.wagonCondition <= 0) return finishJourney(state, "loss")
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.822121

[Killed] ConditionalExpression
JourneyRules.js:486:7
 
 function travel(state) {
   if (state.phase !== "trail") return state
-  if (livingParty(state) === 0) return finishJourney(state, "loss")
+  if (true) return finishJourney(state, "loss")
   if (state.inventory.oxen < 2 || state.wagonCondition <= 0) return finishJourney(state, "loss")
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.524777

[Killed] EqualityOperator
JourneyRules.js:486:7
 
 function travel(state) {
   if (state.phase !== "trail") return state
-  if (livingParty(state) === 0) return finishJourney(state, "loss")
+  if (livingParty(state) !== 0) return finishJourney(state, "loss")
   if (state.inventory.oxen < 2 || state.wagonCondition <= 0) return finishJourney(state, "loss")
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.917087

[Killed] ConditionalExpression
JourneyRules.js:487:7
 function travel(state) {
   if (state.phase !== "trail") return state
   if (livingParty(state) === 0) return finishJourney(state, "loss")
-  if (state.inventory.oxen < 2 || state.wagonCondition <= 0) return finishJourney(state, "loss")
+  if (false) return finishJourney(state, "loss")
 
   var days = RULE_PROFILES[state.rulesProfile].turnDays
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.081904
  type: 'test'
  ...

[Killed] ConditionalExpression
JourneyRules.js:487:7
 function travel(state) {
   if (state.phase !== "trail") return state
   if (livingParty(state) === 0) return finishJourney(state, "loss")
-  if (state.inventory.oxen < 2 || state.wagonCondition <= 0) return finishJourney(state, "loss")
+  if (false || state.wagonCondition <= 0) return finishJourney(state, "loss")
 
   var days = RULE_PROFILES[state.rulesProfile].turnDays
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.791132

[Killed] CallExpression
JourneyRules.js:490:3
   if (state.inventory.oxen < 2 || state.wagonCondition <= 0) return finishJourney(state, "loss")
 
   var days = RULE_PROFILES[state.rulesProfile].turnDays
-  weatherFor(state)
+  ;
   var terrainFactor = state.region === "mountains" ? 0.68 : state.region === "desert" ? 0.82 : 1
   var conditionFactor = Math.max(0.45, Math.min(state.wagonCondition, state.oxenCondition) / 100)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.583937
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:491:23
 
   var days = RULE_PROFILES[state.rulesProfile].turnDays
   weatherFor(state)
-  var terrainFactor = state.region === "mountains" ? 0.68 : state.region === "desert" ? 0.82 : 1
+  var terrainFactor = true ? 0.68 : state.region === "desert" ? 0.82 : 1
   var conditionFactor = Math.max(0.45, Math.min(state.wagonCondition, state.oxenCondition) / 100)
   var distance
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.248593

[Killed] ConditionalExpression
JourneyRules.js:491:61
 
   var days = RULE_PROFILES[state.rulesProfile].turnDays
   weatherFor(state)
-  var terrainFactor = state.region === "mountains" ? 0.68 : state.region === "desert" ? 0.82 : 1
+  var terrainFactor = state.region === "mountains" ? 0.68 : true ? 0.82 : 1
   var conditionFactor = Math.max(0.45, Math.min(state.wagonCondition, state.oxenCondition) / 100)
   var distance
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.308124
  type: 'test'
  ...

[Killed] MethodExpression
JourneyRules.js:492:25
   var days = RULE_PROFILES[state.rulesProfile].turnDays
   weatherFor(state)
   var terrainFactor = state.region === "mountains" ? 0.68 : state.region === "desert" ? 0.82 : 1
-  var conditionFactor = Math.max(0.45, Math.min(state.wagonCondition, state.oxenCondition) / 100)
+  var conditionFactor = Math.min(0.45, Math.min(state.wagonCondition, state.oxenCondition) / 100)
   var distance
   if (state.rulesProfile === "classic-1978") {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.300961

[Killed] MethodExpression
JourneyRules.js:492:40
   var days = RULE_PROFILES[state.rulesProfile].turnDays
   weatherFor(state)
   var terrainFactor = state.region === "mountains" ? 0.68 : state.region === "desert" ? 0.82 : 1
-  var conditionFactor = Math.max(0.45, Math.min(state.wagonCondition, state.oxenCondition) / 100)
+  var conditionFactor = Math.max(0.45, Math.max(state.wagonCondition, state.oxenCondition) / 100)
   var distance
   if (state.rulesProfile === "classic-1978") {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.338161

[Killed] ConditionalExpression
JourneyRules.js:494:7
   var terrainFactor = state.region === "mountains" ? 0.68 : state.region === "desert" ? 0.82 : 1
   var conditionFactor = Math.max(0.45, Math.min(state.wagonCondition, state.oxenCondition) / 100)
   var distance
-  if (state.rulesProfile === "classic-1978") {
+  if (true) {
     var trailVariation = draw(state.rngState)
     state.rngState = trailVariation.seed
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.50985

[Killed] ConditionalExpression
JourneyRules.js:494:7
   var terrainFactor = state.region === "mountains" ? 0.68 : state.region === "desert" ? 0.82 : 1
   var conditionFactor = Math.max(0.45, Math.min(state.wagonCondition, state.oxenCondition) / 100)
   var distance
-  if (state.rulesProfile === "classic-1978") {
+  if (false) {
     var trailVariation = draw(state.rngState)
     state.rngState = trailVariation.seed
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.743865
  type: 'test'

[Killed] EqualityOperator
JourneyRules.js:497:21
   if (state.rulesProfile === "classic-1978") {
     var trailVariation = draw(state.rngState)
     state.rngState = trailVariation.seed
-    var paceBonus = state.pace === "grueling" ? 40 : state.pace === "strenuous" ? 20 : 0
+    var paceBonus = state.pace !== "grueling" ? 40 : state.pace === "strenuous" ? 20 : 0
     var classicMiles = 150 + state.inventory.oxen * 8 + paceBonus + Math.floor(trailVariation.value * 25)
     distance = Math.max(40, Math.round(classicMiles * terrainFactor * conditionFactor))
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.795821
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:497:21
   if (state.rulesProfile === "classic-1978") {
     var trailVariation = draw(state.rngState)
     state.rngState = trailVariation.seed
-    var paceBonus = state.pace === "grueling" ? 40 : state.pace === "strenuous" ? 20 : 0
+    var paceBonus = false ? 40 : state.pace === "strenuous" ? 20 : 0
     var classicMiles = 150 + state.inventory.oxen * 8 + paceBonus + Math.floor(trailVariation.value * 25)
     distance = Math.max(40, Math.round(classicMiles * terrainFactor * conditionFactor))
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.695204
  type: 'test'

[Killed] ArithmeticOperator
JourneyRules.js:498:30
     var trailVariation = draw(state.rngState)
     state.rngState = trailVariation.seed
     var paceBonus = state.pace === "grueling" ? 40 : state.pace === "strenuous" ? 20 : 0
-    var classicMiles = 150 + state.inventory.oxen * 8 + paceBonus + Math.floor(trailVariation.value * 25)
+    var classicMiles = 150 + state.inventory.oxen / 8 + paceBonus + Math.floor(trailVariation.value * 25)
     distance = Math.max(40, Math.round(classicMiles * terrainFactor * conditionFactor))
   } else distance = Math.max(12, Math.round(paceMiles(state.pace) * days * terrainFactor * conditionFactor))
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.390236
  type: 'test'

[Killed] ArithmeticOperator
JourneyRules.js:498:24
     var trailVariation = draw(state.rngState)
     state.rngState = trailVariation.seed
     var paceBonus = state.pace === "grueling" ? 40 : state.pace === "strenuous" ? 20 : 0
-    var classicMiles = 150 + state.inventory.oxen * 8 + paceBonus + Math.floor(trailVariation.value * 25)
+    var classicMiles = 150 + state.inventory.oxen * 8 - paceBonus + Math.floor(trailVariation.value * 25)
     distance = Math.max(40, Math.round(classicMiles * terrainFactor * conditionFactor))
   } else distance = Math.max(12, Math.round(paceMiles(state.pace) * days * terrainFactor * conditionFactor))
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.723456

[Killed] ArithmeticOperator
JourneyRules.js:499:40
     state.rngState = trailVariation.seed
     var paceBonus = state.pace === "grueling" ? 40 : state.pace === "strenuous" ? 20 : 0
     var classicMiles = 150 + state.inventory.oxen * 8 + paceBonus + Math.floor(trailVariation.value * 25)
-    distance = Math.max(40, Math.round(classicMiles * terrainFactor * conditionFactor))
+    distance = Math.max(40, Math.round(classicMiles / terrainFactor * conditionFactor))
   } else distance = Math.max(12, Math.round(paceMiles(state.pace) * days * terrainFactor * conditionFactor))
   updateCalendar(state, days)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.203349
  type: 'test'

[Killed] ArithmeticOperator
JourneyRules.js:499:40
     state.rngState = trailVariation.seed
     var paceBonus = state.pace === "grueling" ? 40 : state.pace === "strenuous" ? 20 : 0
     var classicMiles = 150 + state.inventory.oxen * 8 + paceBonus + Math.floor(trailVariation.value * 25)
-    distance = Math.max(40, Math.round(classicMiles * terrainFactor * conditionFactor))
+    distance = Math.max(40, Math.round(classicMiles * terrainFactor / conditionFactor))
   } else distance = Math.max(12, Math.round(paceMiles(state.pace) * days * terrainFactor * conditionFactor))
   updateCalendar(state, days)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 25.607846

[Killed] BlockStatement
JourneyRules.js:538:53
     return state
   }
   var effect = event.effects[index]
-  var member = state.party.find(function(candidate) { return candidate.alive })
+  var member = state.party.find(function(candidate) {})
   if (event.category === "illness" || event.category === "injury") {
     if (member && event.ailment) member.ailment = event.ailment
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.131897
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:539:39
   }
   var effect = event.effects[index]
   var member = state.party.find(function(candidate) { return candidate.alive })
-  if (event.category === "illness" || event.category === "injury") {
+  if (event.category === "illness" || false) {
     if (member && event.ailment) member.ailment = event.ailment
     var treatment = effect === "use-medicine" && state.inventory.medicine > 0 ? "medicine"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.713958

[Killed] EqualityOperator
JourneyRules.js:539:39
   }
   var effect = event.effects[index]
   var member = state.party.find(function(candidate) { return candidate.alive })
-  if (event.category === "illness" || event.category === "injury") {
+  if (event.category === "illness" || event.category !== "injury") {
     if (member && event.ailment) member.ailment = event.ailment
     var treatment = effect === "use-medicine" && state.inventory.medicine > 0 ? "medicine"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.948485

[Killed] LogicalOperator
JourneyRules.js:540:9
   var effect = event.effects[index]
   var member = state.party.find(function(candidate) { return candidate.alive })
   if (event.category === "illness" || event.category === "injury") {
-    if (member && event.ailment) member.ailment = event.ailment
+    if (member || event.ailment) member.ailment = event.ailment
     var treatment = effect === "use-medicine" && state.inventory.medicine > 0 ? "medicine"
       : effect === "rest-recover" ? "rest" : "continue"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.254494

[Killed] ConditionalExpression
JourneyRules.js:540:9
   var effect = event.effects[index]
   var member = state.party.find(function(candidate) { return candidate.alive })
   if (event.category === "illness" || event.category === "injury") {
-    if (member && event.ailment) member.ailment = event.ailment
+    if (true) member.ailment = event.ailment
     var treatment = effect === "use-medicine" && state.inventory.medicine > 0 ? "medicine"
       : effect === "rest-recover" ? "rest" : "continue"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 6.120125
  type: 'test'
  ...

[Killed] ConditionalExpression
JourneyRules.js:541:21
   var member = state.party.find(function(candidate) { return candidate.alive })
   if (event.category === "illness" || event.category === "injury") {
     if (member && event.ailment) member.ailment = event.ailment
-    var treatment = effect === "use-medicine" && state.inventory.medicine > 0 ? "medicine"
+    var treatment = true ? "medicine"
       : effect === "rest-recover" ? "rest" : "continue"
     if (treatment === "medicine") {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.026802

[Killed] ConditionalExpression
JourneyRules.js:541:21
   var member = state.party.find(function(candidate) { return candidate.alive })
   if (event.category === "illness" || event.category === "injury") {
     if (member && event.ailment) member.ailment = event.ailment
-    var treatment = effect === "use-medicine" && state.inventory.medicine > 0 ? "medicine"
+    var treatment = true && state.inventory.medicine > 0 ? "medicine"
       : effect === "rest-recover" ? "rest" : "continue"
     if (treatment === "medicine") {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.043152

[Killed] ConditionalExpression
JourneyRules.js:542:9
   if (event.category === "illness" || event.category === "injury") {
     if (member && event.ailment) member.ailment = event.ailment
     var treatment = effect === "use-medicine" && state.inventory.medicine > 0 ? "medicine"
-      : effect === "rest-recover" ? "rest" : "continue"
+      : true ? "rest" : "continue"
     if (treatment === "medicine") {
       state.inventory.medicine -= 1
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.705733

[Killed] ConditionalExpression
JourneyRules.js:542:9
   if (event.category === "illness" || event.category === "injury") {
     if (member && event.ailment) member.ailment = event.ailment
     var treatment = effect === "use-medicine" && state.inventory.medicine > 0 ? "medicine"
-      : effect === "rest-recover" ? "rest" : "continue"
+      : false ? "rest" : "continue"
     if (treatment === "medicine") {
       state.inventory.medicine -= 1
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.312874

[Killed] EqualityOperator
JourneyRules.js:543:9
     if (member && event.ailment) member.ailment = event.ailment
     var treatment = effect === "use-medicine" && state.inventory.medicine > 0 ? "medicine"
       : effect === "rest-recover" ? "rest" : "continue"
-    if (treatment === "medicine") {
+    if (treatment !== "medicine") {
       state.inventory.medicine -= 1
     } else if (treatment === "rest") {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.936894

[Killed] ConditionalExpression
JourneyRules.js:543:9
     if (member && event.ailment) member.ailment = event.ailment
     var treatment = effect === "use-medicine" && state.inventory.medicine > 0 ? "medicine"
       : effect === "rest-recover" ? "rest" : "continue"
-    if (treatment === "medicine") {
+    if (true) {
       state.inventory.medicine -= 1
     } else if (treatment === "rest") {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.498338

[Killed] AssignmentOperator
JourneyRules.js:544:7
     var treatment = effect === "use-medicine" && state.inventory.medicine > 0 ? "medicine"
       : effect === "rest-recover" ? "rest" : "continue"
     if (treatment === "medicine") {
-      state.inventory.medicine -= 1
+      state.inventory.medicine += 1
     } else if (treatment === "rest") {
       updateCalendar(state, 2)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 7.3653

[Killed] EqualityOperator
JourneyRules.js:545:16
       : effect === "rest-recover" ? "rest" : "continue"
     if (treatment === "medicine") {
       state.inventory.medicine -= 1
-    } else if (treatment === "rest") {
+    } else if (treatment !== "rest") {
       updateCalendar(state, 2)
     }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 6.004089
  type: 'test'

[Killed] BlockStatement
JourneyRules.js:545:38
       : effect === "rest-recover" ? "rest" : "continue"
     if (treatment === "medicine") {
       state.inventory.medicine -= 1
-    } else if (treatment === "rest") {
-      updateCalendar(state, 2)
-    }
+    } else if (treatment === "rest") {}
     var outcome = draw(state.rngState)
     state.rngState = outcome.seed
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.211543
