[Killed] CallExpression
JourneyRules.js:546:7
     if (treatment === "medicine") {
       state.inventory.medicine -= 1
     } else if (treatment === "rest") {
-      updateCalendar(state, 2)
+      ;
     }
     var outcome = draw(state.rngState)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.82746
  type: 'test'
  ...

[Killed] ConditionalExpression
JourneyRules.js:552:21
     state.rngState = outcome.seed
     var risk = illnessRiskPercent(state, member)
     var recovery = recoveryChancePercent(state, member, treatment)
-    var recovered = outcome.value * 100 < clamp(recovery - Math.round(risk * 0.25), 5, 95)
+    var recovered = false
     if (member) member.health = clamp(member.health + (recovered
       ? treatment === "medicine" ? 10 : treatment === "rest" ? 5 : 1
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.626095

[Killed] ArithmeticOperator
JourneyRules.js:552:21
     state.rngState = outcome.seed
     var risk = illnessRiskPercent(state, member)
     var recovery = recoveryChancePercent(state, member, treatment)
-    var recovered = outcome.value * 100 < clamp(recovery - Math.round(risk * 0.25), 5, 95)
+    var recovered = outcome.value / 100 < clamp(recovery - Math.round(risk * 0.25), 5, 95)
     if (member) member.health = clamp(member.health + (recovered
       ? treatment === "medicine" ? 10 : treatment === "rest" ? 5 : 1
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 8.516723

[Killed] ConditionalExpression
JourneyRules.js:553:9
     var risk = illnessRiskPercent(state, member)
     var recovery = recoveryChancePercent(state, member, treatment)
     var recovered = outcome.value * 100 < clamp(recovery - Math.round(risk * 0.25), 5, 95)
-    if (member) member.health = clamp(member.health + (recovered
+    if (true) member.health = clamp(member.health + (recovered
       ? treatment === "medicine" ? 10 : treatment === "rest" ? 5 : 1
       : treatment === "continue" ? -12 : -5), 0, 100)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.632907
  type: 'test'
  ...

[Killed] ConditionalExpression
JourneyRules.js:553:9
     var risk = illnessRiskPercent(state, member)
     var recovery = recoveryChancePercent(state, member, treatment)
     var recovered = outcome.value * 100 < clamp(recovery - Math.round(risk * 0.25), 5, 95)
-    if (member) member.health = clamp(member.health + (recovered
+    if (false) member.health = clamp(member.health + (recovered
       ? treatment === "medicine" ? 10 : treatment === "rest" ? 5 : 1
       : treatment === "continue" ? -12 : -5), 0, 100)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.018906

[Killed] ConditionalExpression
JourneyRules.js:554:41
     var recovery = recoveryChancePercent(state, member, treatment)
     var recovered = outcome.value * 100 < clamp(recovery - Math.round(risk * 0.25), 5, 95)
     if (member) member.health = clamp(member.health + (recovered
-      ? treatment === "medicine" ? 10 : treatment === "rest" ? 5 : 1
+      ? treatment === "medicine" ? 10 : true ? 5 : 1
       : treatment === "continue" ? -12 : -5), 0, 100)
     if (member && recovered && event.ailment) member.ailment = null
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.215703

[Killed] EqualityOperator
JourneyRules.js:554:41
     var recovery = recoveryChancePercent(state, member, treatment)
     var recovered = outcome.value * 100 < clamp(recovery - Math.round(risk * 0.25), 5, 95)
     if (member) member.health = clamp(member.health + (recovered
-      ? treatment === "medicine" ? 10 : treatment === "rest" ? 5 : 1
+      ? treatment === "medicine" ? 10 : treatment !== "rest" ? 5 : 1
       : treatment === "continue" ? -12 : -5), 0, 100)
     if (member && recovered && event.ailment) member.ailment = null
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.324675

[Killed] ConditionalExpression
JourneyRules.js:555:9
     var recovered = outcome.value * 100 < clamp(recovery - Math.round(risk * 0.25), 5, 95)
     if (member) member.health = clamp(member.health + (recovered
       ? treatment === "medicine" ? 10 : treatment === "rest" ? 5 : 1
-      : treatment === "continue" ? -12 : -5), 0, 100)
+      : false ? -12 : -5), 0, 100)
     if (member && recovered && event.ailment) member.ailment = null
     if (member) updateMemberCondition(state, member, member.ailment || event.category)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.684886

[Killed] EqualityOperator
JourneyRules.js:555:9
     var recovered = outcome.value * 100 < clamp(recovery - Math.round(risk * 0.25), 5, 95)
     if (member) member.health = clamp(member.health + (recovered
       ? treatment === "medicine" ? 10 : treatment === "rest" ? 5 : 1
-      : treatment === "continue" ? -12 : -5), 0, 100)
+      : treatment !== "continue" ? -12 : -5), 0, 100)
     if (member && recovered && event.ailment) member.ailment = null
     if (member) updateMemberCondition(state, member, member.ailment || event.category)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 6.154238
  type: 'test'

[Killed] LogicalOperator
JourneyRules.js:556:9
     if (member) member.health = clamp(member.health + (recovered
       ? treatment === "medicine" ? 10 : treatment === "rest" ? 5 : 1
       : treatment === "continue" ? -12 : -5), 0, 100)
-    if (member && recovered && event.ailment) member.ailment = null
+    if (member || recovered && event.ailment) member.ailment = null
     if (member) updateMemberCondition(state, member, member.ailment || event.category)
     if (!member) state.message = "The party continues"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.820838

[Killed] LogicalOperator
JourneyRules.js:556:9
     if (member) member.health = clamp(member.health + (recovered
       ? treatment === "medicine" ? 10 : treatment === "rest" ? 5 : 1
       : treatment === "continue" ? -12 : -5), 0, 100)
-    if (member && recovered && event.ailment) member.ailment = null
+    if (member && recovered || event.ailment) member.ailment = null
     if (member) updateMemberCondition(state, member, member.ailment || event.category)
     if (!member) state.message = "The party continues"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.112511
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:557:9
       ? treatment === "medicine" ? 10 : treatment === "rest" ? 5 : 1
       : treatment === "continue" ? -12 : -5), 0, 100)
     if (member && recovered && event.ailment) member.ailment = null
-    if (member) updateMemberCondition(state, member, member.ailment || event.category)
+    if (false) updateMemberCondition(state, member, member.ailment || event.category)
     if (!member) state.message = "The party continues"
     else if (event.ailment && !member.alive) state.message = member.name + " died of " + event.ailment
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.33309
  type: 'test'
  ...

[Killed] LogicalOperator
JourneyRules.js:557:54
       ? treatment === "medicine" ? 10 : treatment === "rest" ? 5 : 1
       : treatment === "continue" ? -12 : -5), 0, 100)
     if (member && recovered && event.ailment) member.ailment = null
-    if (member) updateMemberCondition(state, member, member.ailment || event.category)
+    if (member) updateMemberCondition(state, member, member.ailment && event.category)
     if (!member) state.message = "The party continues"
     else if (event.ailment && !member.alive) state.message = member.name + " died of " + event.ailment
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.448836
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:558:9
       : treatment === "continue" ? -12 : -5), 0, 100)
     if (member && recovered && event.ailment) member.ailment = null
     if (member) updateMemberCondition(state, member, member.ailment || event.category)
-    if (!member) state.message = "The party continues"
+    if (true) state.message = "The party continues"
     else if (event.ailment && !member.alive) state.message = member.name + " died of " + event.ailment
     else if (event.ailment && recovered) state.message = member.name + " recovers from " + event.ailment
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.308855
  type: 'test'

[Killed] BooleanLiteral
JourneyRules.js:558:9
       : treatment === "continue" ? -12 : -5), 0, 100)
     if (member && recovered && event.ailment) member.ailment = null
     if (member) updateMemberCondition(state, member, member.ailment || event.category)
-    if (!member) state.message = "The party continues"
+    if (member) state.message = "The party continues"
     else if (event.ailment && !member.alive) state.message = member.name + " died of " + event.ailment
     else if (event.ailment && recovered) state.message = member.name + " recovers from " + event.ailment
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.831337

[Killed] LogicalOperator
JourneyRules.js:559:14
     if (member && recovered && event.ailment) member.ailment = null
     if (member) updateMemberCondition(state, member, member.ailment || event.category)
     if (!member) state.message = "The party continues"
-    else if (event.ailment && !member.alive) state.message = member.name + " died of " + event.ailment
+    else if (event.ailment || !member.alive) state.message = member.name + " died of " + event.ailment
     else if (event.ailment && recovered) state.message = member.name + " recovers from " + event.ailment
     else if (event.ailment) state.message = member.name + " still has " + event.ailment
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.399243

[Killed] ConditionalExpression
JourneyRules.js:559:14
     if (member && recovered && event.ailment) member.ailment = null
     if (member) updateMemberCondition(state, member, member.ailment || event.category)
     if (!member) state.message = "The party continues"
-    else if (event.ailment && !member.alive) state.message = member.name + " died of " + event.ailment
+    else if (false) state.message = member.name + " died of " + event.ailment
     else if (event.ailment && recovered) state.message = member.name + " recovers from " + event.ailment
     else if (event.ailment) state.message = member.name + " still has " + event.ailment
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.909563
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:560:14
     if (member) updateMemberCondition(state, member, member.ailment || event.category)
     if (!member) state.message = "The party continues"
     else if (event.ailment && !member.alive) state.message = member.name + " died of " + event.ailment
-    else if (event.ailment && recovered) state.message = member.name + " recovers from " + event.ailment
+    else if (true) state.message = member.name + " recovers from " + event.ailment
     else if (event.ailment) state.message = member.name + " still has " + event.ailment
     else state.message = member.name + (recovered ? " begins to recover" : " grows weaker")
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.427796
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:560:14
     if (member) updateMemberCondition(state, member, member.ailment || event.category)
     if (!member) state.message = "The party continues"
     else if (event.ailment && !member.alive) state.message = member.name + " died of " + event.ailment
-    else if (event.ailment && recovered) state.message = member.name + " recovers from " + event.ailment
+    else if (false) state.message = member.name + " recovers from " + event.ailment
     else if (event.ailment) state.message = member.name + " still has " + event.ailment
     else state.message = member.name + (recovered ? " begins to recover" : " grows weaker")
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.484343

[Killed] ConditionalExpression
JourneyRules.js:561:14
     if (!member) state.message = "The party continues"
     else if (event.ailment && !member.alive) state.message = member.name + " died of " + event.ailment
     else if (event.ailment && recovered) state.message = member.name + " recovers from " + event.ailment
-    else if (event.ailment) state.message = member.name + " still has " + event.ailment
+    else if (true) state.message = member.name + " still has " + event.ailment
     else state.message = member.name + (recovered ? " begins to recover" : " grows weaker")
   } else if (effect === "use-part") {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.743984

[Killed] ConditionalExpression
JourneyRules.js:561:14
     if (!member) state.message = "The party continues"
     else if (event.ailment && !member.alive) state.message = member.name + " died of " + event.ailment
     else if (event.ailment && recovered) state.message = member.name + " recovers from " + event.ailment
-    else if (event.ailment) state.message = member.name + " still has " + event.ailment
+    else if (false) state.message = member.name + " still has " + event.ailment
     else state.message = member.name + (recovered ? " begins to recover" : " grows weaker")
   } else if (effect === "use-part") {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.26278

[Killed] LogicalOperator
JourneyRules.js:702:7
 }
 
 function rest(state) {
-  if (state.phase !== "trail" && state.phase !== "landmark") return state
+  if (state.phase !== "trail" || state.phase !== "landmark") return state
   updateCalendar(state, 2)
   state.daysRested += 2
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.252441
  type: 'test'

[Killed] EqualityOperator
JourneyRules.js:702:34
 }
 
 function rest(state) {
-  if (state.phase !== "trail" && state.phase !== "landmark") return state
+  if (state.phase !== "trail" && state.phase === "landmark") return state
   updateCalendar(state, 2)
   state.daysRested += 2
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.749975

[Killed] CallExpression
JourneyRules.js:703:3
 
 function rest(state) {
   if (state.phase !== "trail" && state.phase !== "landmark") return state
-  updateCalendar(state, 2)
+  ;
   state.daysRested += 2
   var foodCost = livingParty(state) * foodPerPerson(state.rations) * 2
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.732313

[Killed] AssignmentOperator
JourneyRules.js:704:3
 function rest(state) {
   if (state.phase !== "trail" && state.phase !== "landmark") return state
   updateCalendar(state, 2)
-  state.daysRested += 2
+  state.daysRested -= 2
   var foodCost = livingParty(state) * foodPerPerson(state.rations) * 2
   var fed = state.inventory.food >= foodCost
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.334444
  type: 'test'

[Killed] ArithmeticOperator
JourneyRules.js:705:18
   if (state.phase !== "trail" && state.phase !== "landmark") return state
   updateCalendar(state, 2)
   state.daysRested += 2
-  var foodCost = livingParty(state) * foodPerPerson(state.rations) * 2
+  var foodCost = livingParty(state) / foodPerPerson(state.rations) * 2
   var fed = state.inventory.food >= foodCost
   state.inventory.food = Math.max(0, state.inventory.food - foodCost)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.361354

[Killed] ArithmeticOperator
JourneyRules.js:705:18
   if (state.phase !== "trail" && state.phase !== "landmark") return state
   updateCalendar(state, 2)
   state.daysRested += 2
-  var foodCost = livingParty(state) * foodPerPerson(state.rations) * 2
+  var foodCost = livingParty(state) * foodPerPerson(state.rations) / 2
   var fed = state.inventory.food >= foodCost
   state.inventory.food = Math.max(0, state.inventory.food - foodCost)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.729177
  type: 'test'

[Killed] EqualityOperator
JourneyRules.js:706:13
   updateCalendar(state, 2)
   state.daysRested += 2
   var foodCost = livingParty(state) * foodPerPerson(state.rations) * 2
-  var fed = state.inventory.food >= foodCost
+  var fed = state.inventory.food > foodCost
   state.inventory.food = Math.max(0, state.inventory.food - foodCost)
   var recoveredNames = []
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.683752
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:706:13
   updateCalendar(state, 2)
   state.daysRested += 2
   var foodCost = livingParty(state) * foodPerPerson(state.rations) * 2
-  var fed = state.inventory.food >= foodCost
+  var fed = true
   state.inventory.food = Math.max(0, state.inventory.food - foodCost)
   var recoveredNames = []
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.729939

[Killed] ArithmeticOperator
JourneyRules.js:707:38
   state.daysRested += 2
   var foodCost = livingParty(state) * foodPerPerson(state.rations) * 2
   var fed = state.inventory.food >= foodCost
-  state.inventory.food = Math.max(0, state.inventory.food - foodCost)
+  state.inventory.food = Math.max(0, state.inventory.food + foodCost)
   var recoveredNames = []
   state.party.forEach(function(member) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.534065

[Killed] MethodExpression
JourneyRules.js:707:26
   state.daysRested += 2
   var foodCost = livingParty(state) * foodPerPerson(state.rations) * 2
   var fed = state.inventory.food >= foodCost
-  state.inventory.food = Math.max(0, state.inventory.food - foodCost)
+  state.inventory.food = Math.min(0, state.inventory.food - foodCost)
   var recoveredNames = []
   state.party.forEach(function(member) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.079458

[Killed] BlockStatement
JourneyRules.js:709:40
   var fed = state.inventory.food >= foodCost
   state.inventory.food = Math.max(0, state.inventory.food - foodCost)
   var recoveredNames = []
-  state.party.forEach(function(member) {
-    if (!member.alive) return
-    member.health = clamp(member.health + (fed ? 6 : -8), 0, 100)
-    member.fatigue = clamp(member.fatigue - (fed ? 18 : 4), 0, 100)
-    if (member.ailment === "dysentery" && fed) {
-      var outcome = draw(state.rngState)
-      state.rngState = outcome.seed
-      var risk = illnessRiskPercent(state, member)
-      var recovery = recoveryChancePercent(state, member, "rest")
-      if (outcome.value * 100 < clamp(recovery - Math.round(risk * 0.25), 5, 95)) {
-        member.ailment = null
-        recoveredNames.push(member.name)
-      }
-    }
-    updateMemberCondition(state, member, member.ailment || (fed ? "illness and exhaustion" : "hunger in camp"))
-  })
+  state.party.forEach(function(member) {})
   state.oxenCondition = clamp(state.oxenCondition + (fed ? 5 : 1), 0, 100)
   if (livingParty(state) === 0) return finishJourney(state, "loss")
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.054071

[Killed] ConditionalExpression
JourneyRules.js:710:9
   state.inventory.food = Math.max(0, state.inventory.food - foodCost)
   var recoveredNames = []
   state.party.forEach(function(member) {
-    if (!member.alive) return
+    if (false) return
     member.health = clamp(member.health + (fed ? 6 : -8), 0, 100)
     member.fatigue = clamp(member.fatigue - (fed ? 18 : 4), 0, 100)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.292776

[Killed] ArithmeticOperator
JourneyRules.js:711:27
   var recoveredNames = []
   state.party.forEach(function(member) {
     if (!member.alive) return
-    member.health = clamp(member.health + (fed ? 6 : -8), 0, 100)
+    member.health = clamp(member.health - (fed ? 6 : -8), 0, 100)
     member.fatigue = clamp(member.fatigue - (fed ? 18 : 4), 0, 100)
     if (member.ailment === "dysentery" && fed) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.193201

[Killed] UnaryOperator
JourneyRules.js:711:54
   var recoveredNames = []
   state.party.forEach(function(member) {
     if (!member.alive) return
-    member.health = clamp(member.health + (fed ? 6 : -8), 0, 100)
+    member.health = clamp(member.health + (fed ? 6 : +8), 0, 100)
     member.fatigue = clamp(member.fatigue - (fed ? 18 : 4), 0, 100)
     if (member.ailment === "dysentery" && fed) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.989321
  type: 'test'

[Killed] ArithmeticOperator
JourneyRules.js:712:28
   state.party.forEach(function(member) {
     if (!member.alive) return
     member.health = clamp(member.health + (fed ? 6 : -8), 0, 100)
-    member.fatigue = clamp(member.fatigue - (fed ? 18 : 4), 0, 100)
+    member.fatigue = clamp(member.fatigue + (fed ? 18 : 4), 0, 100)
     if (member.ailment === "dysentery" && fed) {
       var outcome = draw(state.rngState)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.577054

[Killed] EqualityOperator
JourneyRules.js:713:9
     if (!member.alive) return
     member.health = clamp(member.health + (fed ? 6 : -8), 0, 100)
     member.fatigue = clamp(member.fatigue - (fed ? 18 : 4), 0, 100)
-    if (member.ailment === "dysentery" && fed) {
+    if (member.ailment !== "dysentery" && fed) {
       var outcome = draw(state.rngState)
       state.rngState = outcome.seed
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.249004
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:713:9
     if (!member.alive) return
     member.health = clamp(member.health + (fed ? 6 : -8), 0, 100)
     member.fatigue = clamp(member.fatigue - (fed ? 18 : 4), 0, 100)
-    if (member.ailment === "dysentery" && fed) {
+    if (false) {
       var outcome = draw(state.rngState)
       state.rngState = outcome.seed
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.430481

[Killed] EqualityOperator
JourneyRules.js:718:11
       state.rngState = outcome.seed
       var risk = illnessRiskPercent(state, member)
       var recovery = recoveryChancePercent(state, member, "rest")
-      if (outcome.value * 100 < clamp(recovery - Math.round(risk * 0.25), 5, 95)) {
+      if (outcome.value * 100 >= clamp(recovery - Math.round(risk * 0.25), 5, 95)) {
         member.ailment = null
         recoveredNames.push(member.name)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 3.702137

[Killed] ConditionalExpression
JourneyRules.js:718:11
       state.rngState = outcome.seed
       var risk = illnessRiskPercent(state, member)
       var recovery = recoveryChancePercent(state, member, "rest")
-      if (outcome.value * 100 < clamp(recovery - Math.round(risk * 0.25), 5, 95)) {
+      if (false) {
         member.ailment = null
         recoveredNames.push(member.name)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.883072

[Killed] CallExpression
JourneyRules.js:720:9
       var recovery = recoveryChancePercent(state, member, "rest")
       if (outcome.value * 100 < clamp(recovery - Math.round(risk * 0.25), 5, 95)) {
         member.ailment = null
-        recoveredNames.push(member.name)
+        ;
       }
     }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 6.873927
  type: 'test'

[Survived] LogicalOperator
JourneyRules.js:723:42
         recoveredNames.push(member.name)
       }
     }
-    updateMemberCondition(state, member, member.ailment || (fed ? "illness and exhaustion" : "hunger in camp"))
+    updateMemberCondition(state, member, member.ailment && (fed ? "illness and exhaustion" : "hunger in camp"))
   })
   state.oxenCondition = clamp(state.oxenCondition + (fed ? 5 : 1), 0, 100)

[Survived] ConditionalExpression
JourneyRules.js:723:42
         recoveredNames.push(member.name)
       }
     }
-    updateMemberCondition(state, member, member.ailment || (fed ? "illness and exhaustion" : "hunger in camp"))
+    updateMemberCondition(state, member, false)
   })
   state.oxenCondition = clamp(state.oxenCondition + (fed ? 5 : 1), 0, 100)
