[Killed] ArithmeticOperator
JourneyRules.js:725:31
     }
     updateMemberCondition(state, member, member.ailment || (fed ? "illness and exhaustion" : "hunger in camp"))
   })
-  state.oxenCondition = clamp(state.oxenCondition + (fed ? 5 : 1), 0, 100)
+  state.oxenCondition = clamp(state.oxenCondition - (fed ? 5 : 1), 0, 100)
   if (livingParty(state) === 0) return finishJourney(state, "loss")
   state.message = recoveredNames.length
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.616518
  type: 'test'
  ...

[Killed] ConditionalExpression
JourneyRules.js:726:7
     updateMemberCondition(state, member, member.ailment || (fed ? "illness and exhaustion" : "hunger in camp"))
   })
   state.oxenCondition = clamp(state.oxenCondition + (fed ? 5 : 1), 0, 100)
-  if (livingParty(state) === 0) return finishJourney(state, "loss")
+  if (false) return finishJourney(state, "loss")
   state.message = recoveredNames.length
     ? recoveredNames.join(", ") + " recovered from dysentery"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.625796
  type: 'test'

[Killed] EqualityOperator
JourneyRules.js:726:7
     updateMemberCondition(state, member, member.ailment || (fed ? "illness and exhaustion" : "hunger in camp"))
   })
   state.oxenCondition = clamp(state.oxenCondition + (fed ? 5 : 1), 0, 100)
-  if (livingParty(state) === 0) return finishJourney(state, "loss")
+  if (livingParty(state) !== 0) return finishJourney(state, "loss")
   state.message = recoveredNames.length
     ? recoveredNames.join(", ") + " recovered from dysentery"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.584688

[Killed] BlockStatement
JourneyRules.js:733:24
   return state
 }
 
-function repair(state) {
-  if (state.phase !== "trail" && state.phase !== "landmark") return state
-  if (state.inventory.parts <= 0 || state.wagonCondition >= 100) {
-    state.message = state.inventory.parts <= 0 ? "No wagon parts remain" : "The wagon needs no repair"
-    return state
-  }
-  state.inventory.parts -= 1
-  state.wagonCondition = clamp(state.wagonCondition + 25 + OCCUPATIONS[state.occupation].repairBonus, 0, 100)
-  state.message = "The party repairs the wagon"
-  return state
-}
+function repair(state) {}
 
 function beginHunt(state) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.859399

[Killed] LogicalOperator
JourneyRules.js:734:7
 }
 
 function repair(state) {
-  if (state.phase !== "trail" && state.phase !== "landmark") return state
+  if (state.phase !== "trail" || state.phase !== "landmark") return state
   if (state.inventory.parts <= 0 || state.wagonCondition >= 100) {
     state.message = state.inventory.parts <= 0 ? "No wagon parts remain" : "The wagon needs no repair"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 7.129362

[Killed] EqualityOperator
JourneyRules.js:734:7
 }
 
 function repair(state) {
-  if (state.phase !== "trail" && state.phase !== "landmark") return state
+  if (state.phase === "trail" && state.phase !== "landmark") return state
   if (state.inventory.parts <= 0 || state.wagonCondition >= 100) {
     state.message = state.inventory.parts <= 0 ? "No wagon parts remain" : "The wagon needs no repair"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.745377

[Killed] EqualityOperator
JourneyRules.js:735:7
 
 function repair(state) {
   if (state.phase !== "trail" && state.phase !== "landmark") return state
-  if (state.inventory.parts <= 0 || state.wagonCondition >= 100) {
+  if (state.inventory.parts > 0 || state.wagonCondition >= 100) {
     state.message = state.inventory.parts <= 0 ? "No wagon parts remain" : "The wagon needs no repair"
     return state
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.038684

[Killed] ConditionalExpression
JourneyRules.js:735:7
 
 function repair(state) {
   if (state.phase !== "trail" && state.phase !== "landmark") return state
-  if (state.inventory.parts <= 0 || state.wagonCondition >= 100) {
+  if (false) {
     state.message = state.inventory.parts <= 0 ? "No wagon parts remain" : "The wagon needs no repair"
     return state
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.578016

[Killed] EqualityOperator
JourneyRules.js:736:21
 function repair(state) {
   if (state.phase !== "trail" && state.phase !== "landmark") return state
   if (state.inventory.parts <= 0 || state.wagonCondition >= 100) {
-    state.message = state.inventory.parts <= 0 ? "No wagon parts remain" : "The wagon needs no repair"
+    state.message = state.inventory.parts < 0 ? "No wagon parts remain" : "The wagon needs no repair"
     return state
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.970977
  type: 'test'
  ...

[Killed] ConditionalExpression
JourneyRules.js:736:21
 function repair(state) {
   if (state.phase !== "trail" && state.phase !== "landmark") return state
   if (state.inventory.parts <= 0 || state.wagonCondition >= 100) {
-    state.message = state.inventory.parts <= 0 ? "No wagon parts remain" : "The wagon needs no repair"
+    state.message = true ? "No wagon parts remain" : "The wagon needs no repair"
     return state
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.758773
  type: 'test'

[Killed] AssignmentOperator
JourneyRules.js:739:3
     state.message = state.inventory.parts <= 0 ? "No wagon parts remain" : "The wagon needs no repair"
     return state
   }
-  state.inventory.parts -= 1
+  state.inventory.parts += 1
   state.wagonCondition = clamp(state.wagonCondition + 25 + OCCUPATIONS[state.occupation].repairBonus, 0, 100)
   state.message = "The party repairs the wagon"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.133219
  type: 'test'
  ...

[Killed] ArithmeticOperator
JourneyRules.js:740:32
     return state
   }
   state.inventory.parts -= 1
-  state.wagonCondition = clamp(state.wagonCondition + 25 + OCCUPATIONS[state.occupation].repairBonus, 0, 100)
+  state.wagonCondition = clamp(state.wagonCondition + 25 - OCCUPATIONS[state.occupation].repairBonus, 0, 100)
   state.message = "The party repairs the wagon"
   return state
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.210331
  type: 'test'
  ...

[Killed] ArithmeticOperator
JourneyRules.js:740:32
     return state
   }
   state.inventory.parts -= 1
-  state.wagonCondition = clamp(state.wagonCondition + 25 + OCCUPATIONS[state.occupation].repairBonus, 0, 100)
+  state.wagonCondition = clamp(state.wagonCondition - 25 + OCCUPATIONS[state.occupation].repairBonus, 0, 100)
   state.message = "The party repairs the wagon"
   return state
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.920463

[Killed] BlockStatement
JourneyRules.js:745:27
   return state
 }
 
-function beginHunt(state) {
-  if (state.phase !== "trail" && state.phase !== "landmark") return state
-  var requiredAmmo = minimumHuntAmmo(state)
-  if (state.inventory.ammunition < requiredAmmo) {
-    state.message = state.rulesProfile === "classic-1978"
-      ? "Classic hunting needs at least 40 rounds" : "No ammunition remains"
-    return state
-  }
-  if (state.rulesProfile === "classic-1978" && state.lastHuntMile === state.miles) {
-    state.message = "Classic hunting is available again after traveling"
-    return state
-  }
-  var seedDraw = draw(state.rngState)
-  state.rngState = seedDraw.seed
-  state.phase = "hunt"
-  state.huntSeed = seedDraw.seed
-  state.message = "The party prepares to hunt"
-  return state
-}
+function beginHunt(state) {}
 
 function applyHuntResult(state, result) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.172673

[Killed] ConditionalExpression
JourneyRules.js:746:7
 }
 
 function beginHunt(state) {
-  if (state.phase !== "trail" && state.phase !== "landmark") return state
+  if (false) return state
   var requiredAmmo = minimumHuntAmmo(state)
   if (state.inventory.ammunition < requiredAmmo) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.265795
  type: 'test'

[Killed] LogicalOperator
JourneyRules.js:746:7
 }
 
 function beginHunt(state) {
-  if (state.phase !== "trail" && state.phase !== "landmark") return state
+  if (state.phase !== "trail" || state.phase !== "landmark") return state
   var requiredAmmo = minimumHuntAmmo(state)
   if (state.inventory.ammunition < requiredAmmo) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.696508

[Killed] EqualityOperator
JourneyRules.js:748:7
 function beginHunt(state) {
   if (state.phase !== "trail" && state.phase !== "landmark") return state
   var requiredAmmo = minimumHuntAmmo(state)
-  if (state.inventory.ammunition < requiredAmmo) {
+  if (state.inventory.ammunition <= requiredAmmo) {
     state.message = state.rulesProfile === "classic-1978"
       ? "Classic hunting needs at least 40 rounds" : "No ammunition remains"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.039906

[Killed] EqualityOperator
JourneyRules.js:748:7
 function beginHunt(state) {
   if (state.phase !== "trail" && state.phase !== "landmark") return state
   var requiredAmmo = minimumHuntAmmo(state)
-  if (state.inventory.ammunition < requiredAmmo) {
+  if (state.inventory.ammunition >= requiredAmmo) {
     state.message = state.rulesProfile === "classic-1978"
       ? "Classic hunting needs at least 40 rounds" : "No ammunition remains"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.493208
  type: 'test'
  ...

[Killed] ConditionalExpression
JourneyRules.js:749:21
   if (state.phase !== "trail" && state.phase !== "landmark") return state
   var requiredAmmo = minimumHuntAmmo(state)
   if (state.inventory.ammunition < requiredAmmo) {
-    state.message = state.rulesProfile === "classic-1978"
+    state.message = false
       ? "Classic hunting needs at least 40 rounds" : "No ammunition remains"
     return state
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.126206

[Killed] EqualityOperator
JourneyRules.js:749:21
   if (state.phase !== "trail" && state.phase !== "landmark") return state
   var requiredAmmo = minimumHuntAmmo(state)
   if (state.inventory.ammunition < requiredAmmo) {
-    state.message = state.rulesProfile === "classic-1978"
+    state.message = state.rulesProfile !== "classic-1978"
       ? "Classic hunting needs at least 40 rounds" : "No ammunition remains"
     return state
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.514148

[Killed] EqualityOperator
JourneyRules.js:753:48
       ? "Classic hunting needs at least 40 rounds" : "No ammunition remains"
     return state
   }
-  if (state.rulesProfile === "classic-1978" && state.lastHuntMile === state.miles) {
+  if (state.rulesProfile === "classic-1978" && state.lastHuntMile !== state.miles) {
     state.message = "Classic hunting is available again after traveling"
     return state
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.47816

[Killed] BlockStatement
JourneyRules.js:753:84
       ? "Classic hunting needs at least 40 rounds" : "No ammunition remains"
     return state
   }
-  if (state.rulesProfile === "classic-1978" && state.lastHuntMile === state.miles) {
-    state.message = "Classic hunting is available again after traveling"
-    return state
-  }
+  if (state.rulesProfile === "classic-1978" && state.lastHuntMile === state.miles) {}
   var seedDraw = draw(state.rngState)
   state.rngState = seedDraw.seed
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.105127
  type: 'test'

[Killed] LogicalOperator
JourneyRules.js:766:7
 }
 
 function applyHuntResult(state, result) {
-  if (state.phase !== "hunt" || !result || typeof result !== "object") return state
+  if ((state.phase !== "hunt" || !result) && typeof result !== "object") return state
   var ammoUsed = clamp(Math.round(finiteNumber(result.ammoUsed, 0)), 0, state.inventory.ammunition)
   var reportedCarried = clamp(Math.round(finiteNumber(result.carriedPounds, 0)), 0, 200)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.643628
  type: 'test'
  ...

[Killed] ConditionalExpression
JourneyRules.js:766:44
 }
 
 function applyHuntResult(state, result) {
-  if (state.phase !== "hunt" || !result || typeof result !== "object") return state
+  if (state.phase !== "hunt" || !result || false) return state
   var ammoUsed = clamp(Math.round(finiteNumber(result.ammoUsed, 0)), 0, state.inventory.ammunition)
   var reportedCarried = clamp(Math.round(finiteNumber(result.carriedPounds, 0)), 0, 200)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.284931

[Killed] EqualityOperator
JourneyRules.js:769:27
   if (state.phase !== "hunt" || !result || typeof result !== "object") return state
   var ammoUsed = clamp(Math.round(finiteNumber(result.ammoUsed, 0)), 0, state.inventory.ammunition)
   var reportedCarried = clamp(Math.round(finiteNumber(result.carriedPounds, 0)), 0, 200)
-  var classicCarryLimit = state.rulesProfile === "classic-1978" ? 100 : 200
+  var classicCarryLimit = state.rulesProfile !== "classic-1978" ? 100 : 200
   var carried = Math.min(reportedCarried, classicCarryLimit)
   var wasted = Math.max(0, Math.round(finiteNumber(result.wastedPounds, 0))) + Math.max(0, reportedCarried - carried)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.255546
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:769:27
   if (state.phase !== "hunt" || !result || typeof result !== "object") return state
   var ammoUsed = clamp(Math.round(finiteNumber(result.ammoUsed, 0)), 0, state.inventory.ammunition)
   var reportedCarried = clamp(Math.round(finiteNumber(result.carriedPounds, 0)), 0, 200)
-  var classicCarryLimit = state.rulesProfile === "classic-1978" ? 100 : 200
+  var classicCarryLimit = true ? 100 : 200
   var carried = Math.min(reportedCarried, classicCarryLimit)
   var wasted = Math.max(0, Math.round(finiteNumber(result.wastedPounds, 0))) + Math.max(0, reportedCarried - carried)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 6.059752
  type: 'test'
  ...

[Killed] MethodExpression
JourneyRules.js:770:17
   var ammoUsed = clamp(Math.round(finiteNumber(result.ammoUsed, 0)), 0, state.inventory.ammunition)
   var reportedCarried = clamp(Math.round(finiteNumber(result.carriedPounds, 0)), 0, 200)
   var classicCarryLimit = state.rulesProfile === "classic-1978" ? 100 : 200
-  var carried = Math.min(reportedCarried, classicCarryLimit)
+  var carried = Math.max(reportedCarried, classicCarryLimit)
   var wasted = Math.max(0, Math.round(finiteNumber(result.wastedPounds, 0))) + Math.max(0, reportedCarried - carried)
   var days = clamp(Math.round(finiteNumber(result.expeditionDays, 1)), 1, 2)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.61243
  type: 'test'

[Killed] MethodExpression
JourneyRules.js:771:16
   var reportedCarried = clamp(Math.round(finiteNumber(result.carriedPounds, 0)), 0, 200)
   var classicCarryLimit = state.rulesProfile === "classic-1978" ? 100 : 200
   var carried = Math.min(reportedCarried, classicCarryLimit)
-  var wasted = Math.max(0, Math.round(finiteNumber(result.wastedPounds, 0))) + Math.max(0, reportedCarried - carried)
+  var wasted = Math.min(0, Math.round(finiteNumber(result.wastedPounds, 0))) + Math.max(0, reportedCarried - carried)
   var days = clamp(Math.round(finiteNumber(result.expeditionDays, 1)), 1, 2)
   var energy = clamp(Math.round(finiteNumber(result.partyEnergyCost, 8)), 0, 25)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 3.469524
  type: 'test'

[Killed] MethodExpression
JourneyRules.js:771:80
   var reportedCarried = clamp(Math.round(finiteNumber(result.carriedPounds, 0)), 0, 200)
   var classicCarryLimit = state.rulesProfile === "classic-1978" ? 100 : 200
   var carried = Math.min(reportedCarried, classicCarryLimit)
-  var wasted = Math.max(0, Math.round(finiteNumber(result.wastedPounds, 0))) + Math.max(0, reportedCarried - carried)
+  var wasted = Math.max(0, Math.round(finiteNumber(result.wastedPounds, 0))) + Math.min(0, reportedCarried - carried)
   var days = clamp(Math.round(finiteNumber(result.expeditionDays, 1)), 1, 2)
   var energy = clamp(Math.round(finiteNumber(result.partyEnergyCost, 8)), 0, 25)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.572976
  type: 'test'

[Killed] EqualityOperator
JourneyRules.js:774:16
   var wasted = Math.max(0, Math.round(finiteNumber(result.wastedPounds, 0))) + Math.max(0, reportedCarried - carried)
   var days = clamp(Math.round(finiteNumber(result.expeditionDays, 1)), 1, 2)
   var energy = clamp(Math.round(finiteNumber(result.partyEnergyCost, 8)), 0, 25)
-  var injury = result.injury === true
+  var injury = result.injury !== true
   var riskPercent = clamp(Math.round(finiteNumber(result.riskPercent, 0)), 0, 100)
   state.inventory.ammunition -= ammoUsed
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.931834
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:774:16
   var wasted = Math.max(0, Math.round(finiteNumber(result.wastedPounds, 0))) + Math.max(0, reportedCarried - carried)
   var days = clamp(Math.round(finiteNumber(result.expeditionDays, 1)), 1, 2)
   var energy = clamp(Math.round(finiteNumber(result.partyEnergyCost, 8)), 0, 25)
-  var injury = result.injury === true
+  var injury = true
   var riskPercent = clamp(Math.round(finiteNumber(result.riskPercent, 0)), 0, 100)
   state.inventory.ammunition -= ammoUsed
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.555605
  type: 'test'

[Killed] AssignmentOperator
JourneyRules.js:776:3
   var energy = clamp(Math.round(finiteNumber(result.partyEnergyCost, 8)), 0, 25)
   var injury = result.injury === true
   var riskPercent = clamp(Math.round(finiteNumber(result.riskPercent, 0)), 0, 100)
-  state.inventory.ammunition -= ammoUsed
+  state.inventory.ammunition += ammoUsed
   state.inventory.food = Math.min(1200, state.inventory.food + carried)
   state.hunts += 1
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.489862
  type: 'test'

[Killed] MethodExpression
JourneyRules.js:777:26
   var injury = result.injury === true
   var riskPercent = clamp(Math.round(finiteNumber(result.riskPercent, 0)), 0, 100)
   state.inventory.ammunition -= ammoUsed
-  state.inventory.food = Math.min(1200, state.inventory.food + carried)
+  state.inventory.food = Math.max(1200, state.inventory.food + carried)
   state.hunts += 1
   if (state.rulesProfile === "classic-1978") state.lastHuntMile = state.miles
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.437394

[Killed] ArithmeticOperator
JourneyRules.js:777:41
   var injury = result.injury === true
   var riskPercent = clamp(Math.round(finiteNumber(result.riskPercent, 0)), 0, 100)
   state.inventory.ammunition -= ammoUsed
-  state.inventory.food = Math.min(1200, state.inventory.food + carried)
+  state.inventory.food = Math.min(1200, state.inventory.food - carried)
   state.hunts += 1
   if (state.rulesProfile === "classic-1978") state.lastHuntMile = state.miles
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.201205

[Killed] AssignmentOperator
JourneyRules.js:778:3
   var riskPercent = clamp(Math.round(finiteNumber(result.riskPercent, 0)), 0, 100)
   state.inventory.ammunition -= ammoUsed
   state.inventory.food = Math.min(1200, state.inventory.food + carried)
-  state.hunts += 1
+  state.hunts -= 1
   if (state.rulesProfile === "classic-1978") state.lastHuntMile = state.miles
   state.harvestedPounds += carried + wasted
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 3.994471
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:779:7
   state.inventory.ammunition -= ammoUsed
   state.inventory.food = Math.min(1200, state.inventory.food + carried)
   state.hunts += 1
-  if (state.rulesProfile === "classic-1978") state.lastHuntMile = state.miles
+  if (false) state.lastHuntMile = state.miles
   state.harvestedPounds += carried + wasted
   state.wastedPounds += wasted
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.967501
  type: 'test'

[Killed] EqualityOperator
JourneyRules.js:779:7
   state.inventory.ammunition -= ammoUsed
   state.inventory.food = Math.min(1200, state.inventory.food + carried)
   state.hunts += 1
-  if (state.rulesProfile === "classic-1978") state.lastHuntMile = state.miles
+  if (state.rulesProfile !== "classic-1978") state.lastHuntMile = state.miles
   state.harvestedPounds += carried + wasted
   state.wastedPounds += wasted
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.101138

[Killed] AssignmentOperator
JourneyRules.js:780:3
   state.inventory.food = Math.min(1200, state.inventory.food + carried)
   state.hunts += 1
   if (state.rulesProfile === "classic-1978") state.lastHuntMile = state.miles
-  state.harvestedPounds += carried + wasted
+  state.harvestedPounds -= carried + wasted
   state.wastedPounds += wasted
   updateCalendar(state, days)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.492016

[Killed] ArithmeticOperator
JourneyRules.js:780:28
   state.inventory.food = Math.min(1200, state.inventory.food + carried)
   state.hunts += 1
   if (state.rulesProfile === "classic-1978") state.lastHuntMile = state.miles
-  state.harvestedPounds += carried + wasted
+  state.harvestedPounds += carried - wasted
   state.wastedPounds += wasted
   updateCalendar(state, days)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.339912
  type: 'test'

[Killed] AssignmentOperator
JourneyRules.js:781:3
   state.hunts += 1
   if (state.rulesProfile === "classic-1978") state.lastHuntMile = state.miles
   state.harvestedPounds += carried + wasted
-  state.wastedPounds += wasted
+  state.wastedPounds -= wasted
   updateCalendar(state, days)
   state.party.forEach(function(member) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.900226

[Killed] CallExpression
JourneyRules.js:782:3
   if (state.rulesProfile === "classic-1978") state.lastHuntMile = state.miles
   state.harvestedPounds += carried + wasted
   state.wastedPounds += wasted
-  updateCalendar(state, days)
+  ;
   state.party.forEach(function(member) {
     if (member.alive) member.fatigue = clamp(member.fatigue + energy, 0, 100)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.75729

[Killed] BlockStatement
JourneyRules.js:783:40
   state.harvestedPounds += carried + wasted
   state.wastedPounds += wasted
   updateCalendar(state, days)
-  state.party.forEach(function(member) {
-    if (member.alive) member.fatigue = clamp(member.fatigue + energy, 0, 100)
-  })
+  state.party.forEach(function(member) {})
   var injuredMember = injury ? state.party.find(function(member) { return member.alive }) : null
   if (injuredMember) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 8.921526
  type: 'test'

[Killed] ArithmeticOperator
JourneyRules.js:784:46
   state.wastedPounds += wasted
   updateCalendar(state, days)
   state.party.forEach(function(member) {
-    if (member.alive) member.fatigue = clamp(member.fatigue + energy, 0, 100)
+    if (member.alive) member.fatigue = clamp(member.fatigue - energy, 0, 100)
   })
   var injuredMember = injury ? state.party.find(function(member) { return member.alive }) : null
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.582956

[Killed] ConditionalExpression
JourneyRules.js:784:9
   state.wastedPounds += wasted
   updateCalendar(state, days)
   state.party.forEach(function(member) {
-    if (member.alive) member.fatigue = clamp(member.fatigue + energy, 0, 100)
+    if (true) member.fatigue = clamp(member.fatigue + energy, 0, 100)
   })
   var injuredMember = injury ? state.party.find(function(member) { return member.alive }) : null
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.832239
