[Killed] BlockStatement
JourneyRules.js:786:66
   state.party.forEach(function(member) {
     if (member.alive) member.fatigue = clamp(member.fatigue + energy, 0, 100)
   })
-  var injuredMember = injury ? state.party.find(function(member) { return member.alive }) : null
+  var injuredMember = injury ? state.party.find(function(member) {}) : null
   if (injuredMember) {
     injuredMember.health = clamp(injuredMember.health - 12, 0, 100)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.240638
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:787:7
     if (member.alive) member.fatigue = clamp(member.fatigue + energy, 0, 100)
   })
   var injuredMember = injury ? state.party.find(function(member) { return member.alive }) : null
-  if (injuredMember) {
+  if (false) {
     injuredMember.health = clamp(injuredMember.health - 12, 0, 100)
     updateMemberCondition(state, injuredMember, "hunting injury")
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 3.723076
  type: 'test'
  ...

[Killed] ConditionalExpression
JourneyRules.js:787:7
     if (member.alive) member.fatigue = clamp(member.fatigue + energy, 0, 100)
   })
   var injuredMember = injury ? state.party.find(function(member) { return member.alive }) : null
-  if (injuredMember) {
+  if (true) {
     injuredMember.health = clamp(injuredMember.health - 12, 0, 100)
     updateMemberCondition(state, injuredMember, "hunting injury")
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.884928

[Killed] ArithmeticOperator
JourneyRules.js:788:34
   })
   var injuredMember = injury ? state.party.find(function(member) { return member.alive }) : null
   if (injuredMember) {
-    injuredMember.health = clamp(injuredMember.health - 12, 0, 100)
+    injuredMember.health = clamp(injuredMember.health + 12, 0, 100)
     updateMemberCondition(state, injuredMember, "hunting injury")
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 12.491276
  type: 'test'

[Killed] CallExpression
JourneyRules.js:789:5
   var injuredMember = injury ? state.party.find(function(member) { return member.alive }) : null
   if (injuredMember) {
     injuredMember.health = clamp(injuredMember.health - 12, 0, 100)
-    updateMemberCondition(state, injuredMember, "hunting injury")
+    ;
   }
   state.phase = "trail"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.706245

[Killed] BlockStatement
JourneyRules.js:799:30
   return state
 }
 
-function scoreJourney(state) {
-  var survivors = livingParty(state)
-  var resourceScore = Math.round(state.inventory.food / 5 + state.inventory.ammunition + state.cash / 4)
-  var healthScore = totalPartyHealth(state) * survivors
-  var timePenalty = Math.max(0, state.month * 30 + state.day - 120)
-  var difficultyScale = state.difficulty === "hard" ? 1.35 : state.difficulty === "easy" ? 0.80 : 1
-  return Math.max(0, Math.round((survivors * 300 + healthScore + resourceScore - state.wastedPounds - timePenalty) * difficultyScale))
-}
+function scoreJourney(state) {}
 
 function journeyDurationDays(state) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 6.395767
  type: 'test'
  ...

[Killed] ArithmeticOperator
JourneyRules.js:801:34
 
 function scoreJourney(state) {
   var survivors = livingParty(state)
-  var resourceScore = Math.round(state.inventory.food / 5 + state.inventory.ammunition + state.cash / 4)
+  var resourceScore = Math.round(state.inventory.food * 5 + state.inventory.ammunition + state.cash / 4)
   var healthScore = totalPartyHealth(state) * survivors
   var timePenalty = Math.max(0, state.month * 30 + state.day - 120)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.492327

[Killed] ArithmeticOperator
JourneyRules.js:801:90
 
 function scoreJourney(state) {
   var survivors = livingParty(state)
-  var resourceScore = Math.round(state.inventory.food / 5 + state.inventory.ammunition + state.cash / 4)
+  var resourceScore = Math.round(state.inventory.food / 5 + state.inventory.ammunition + state.cash * 4)
   var healthScore = totalPartyHealth(state) * survivors
   var timePenalty = Math.max(0, state.month * 30 + state.day - 120)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.376912

[Killed] ArithmeticOperator
JourneyRules.js:802:21
 function scoreJourney(state) {
   var survivors = livingParty(state)
   var resourceScore = Math.round(state.inventory.food / 5 + state.inventory.ammunition + state.cash / 4)
-  var healthScore = totalPartyHealth(state) * survivors
+  var healthScore = totalPartyHealth(state) / survivors
   var timePenalty = Math.max(0, state.month * 30 + state.day - 120)
   var difficultyScale = state.difficulty === "hard" ? 1.35 : state.difficulty === "easy" ? 0.80 : 1
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.064752
  type: 'test'

[Killed] MethodExpression
JourneyRules.js:803:21
   var survivors = livingParty(state)
   var resourceScore = Math.round(state.inventory.food / 5 + state.inventory.ammunition + state.cash / 4)
   var healthScore = totalPartyHealth(state) * survivors
-  var timePenalty = Math.max(0, state.month * 30 + state.day - 120)
+  var timePenalty = Math.min(0, state.month * 30 + state.day - 120)
   var difficultyScale = state.difficulty === "hard" ? 1.35 : state.difficulty === "easy" ? 0.80 : 1
   return Math.max(0, Math.round((survivors * 300 + healthScore + resourceScore - state.wastedPounds - timePenalty) * difficultyScale))
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.517543

[Killed] ArithmeticOperator
JourneyRules.js:803:33
   var survivors = livingParty(state)
   var resourceScore = Math.round(state.inventory.food / 5 + state.inventory.ammunition + state.cash / 4)
   var healthScore = totalPartyHealth(state) * survivors
-  var timePenalty = Math.max(0, state.month * 30 + state.day - 120)
+  var timePenalty = Math.max(0, state.month * 30 - state.day - 120)
   var difficultyScale = state.difficulty === "hard" ? 1.35 : state.difficulty === "easy" ? 0.80 : 1
   return Math.max(0, Math.round((survivors * 300 + healthScore + resourceScore - state.wastedPounds - timePenalty) * difficultyScale))
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.544834
  type: 'test'
  ...

[Killed] ConditionalExpression
JourneyRules.js:804:25
   var resourceScore = Math.round(state.inventory.food / 5 + state.inventory.ammunition + state.cash / 4)
   var healthScore = totalPartyHealth(state) * survivors
   var timePenalty = Math.max(0, state.month * 30 + state.day - 120)
-  var difficultyScale = state.difficulty === "hard" ? 1.35 : state.difficulty === "easy" ? 0.80 : 1
+  var difficultyScale = true ? 1.35 : state.difficulty === "easy" ? 0.80 : 1
   return Math.max(0, Math.round((survivors * 300 + healthScore + resourceScore - state.wastedPounds - timePenalty) * difficultyScale))
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.643598

[Killed] EqualityOperator
JourneyRules.js:804:62
   var resourceScore = Math.round(state.inventory.food / 5 + state.inventory.ammunition + state.cash / 4)
   var healthScore = totalPartyHealth(state) * survivors
   var timePenalty = Math.max(0, state.month * 30 + state.day - 120)
-  var difficultyScale = state.difficulty === "hard" ? 1.35 : state.difficulty === "easy" ? 0.80 : 1
+  var difficultyScale = state.difficulty === "hard" ? 1.35 : state.difficulty !== "easy" ? 0.80 : 1
   return Math.max(0, Math.round((survivors * 300 + healthScore + resourceScore - state.wastedPounds - timePenalty) * difficultyScale))
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.156172
  type: 'test'
  ...

[Killed] ArithmeticOperator
JourneyRules.js:805:34
   var healthScore = totalPartyHealth(state) * survivors
   var timePenalty = Math.max(0, state.month * 30 + state.day - 120)
   var difficultyScale = state.difficulty === "hard" ? 1.35 : state.difficulty === "easy" ? 0.80 : 1
-  return Math.max(0, Math.round((survivors * 300 + healthScore + resourceScore - state.wastedPounds - timePenalty) * difficultyScale))
+  return Math.max(0, Math.round((survivors * 300 + healthScore + resourceScore + state.wastedPounds - timePenalty) * difficultyScale))
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.980876
  type: 'test'

[Killed] ArithmeticOperator
JourneyRules.js:805:34
   var healthScore = totalPartyHealth(state) * survivors
   var timePenalty = Math.max(0, state.month * 30 + state.day - 120)
   var difficultyScale = state.difficulty === "hard" ? 1.35 : state.difficulty === "easy" ? 0.80 : 1
-  return Math.max(0, Math.round((survivors * 300 + healthScore + resourceScore - state.wastedPounds - timePenalty) * difficultyScale))
+  return Math.max(0, Math.round((survivors * 300 + healthScore + resourceScore - state.wastedPounds + timePenalty) * difficultyScale))
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.08031
  type: 'test'
  ...

[Killed] BlockStatement
JourneyRules.js:808:37
   return Math.max(0, Math.round((survivors * 300 + healthScore + resourceScore - state.wastedPounds - timePenalty) * difficultyScale))
 }
 
-function journeyDurationDays(state) {
-  var departureYear = RULE_PROFILES[state.rulesProfile].year
-  return Math.max(0, (state.year - departureYear) * 360 + (state.month - state.departureMonth) * 30 + state.day - 1)
-}
+function journeyDurationDays(state) {}
 
 function finishJourney(state, reason) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.707176
  type: 'test'

[Killed] ArithmeticOperator
JourneyRules.js:810:22
 
 function journeyDurationDays(state) {
   var departureYear = RULE_PROFILES[state.rulesProfile].year
-  return Math.max(0, (state.year - departureYear) * 360 + (state.month - state.departureMonth) * 30 + state.day - 1)
+  return Math.max(0, (state.year - departureYear) * 360 + (state.month - state.departureMonth) * 30 + state.day + 1)
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.02085

[Killed] ArithmeticOperator
JourneyRules.js:810:60
 
 function journeyDurationDays(state) {
   var departureYear = RULE_PROFILES[state.rulesProfile].year
-  return Math.max(0, (state.year - departureYear) * 360 + (state.month - state.departureMonth) * 30 + state.day - 1)
+  return Math.max(0, (state.year - departureYear) * 360 + (state.month + state.departureMonth) * 30 + state.day - 1)
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 7.625254
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:1055:21
 }
 
 function parseSave(raw) {
-  var text = String(raw || "")
+  var text = String(true)
   var size = utf8Length(text)
   if (!text || size > MAX_SAVE_BYTES) return { valid: false, reason: size > MAX_SAVE_BYTES ? "oversized" : "missing", state: null }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 6.226172

[Killed] ConditionalExpression
JourneyRules.js:1055:21
 }
 
 function parseSave(raw) {
-  var text = String(raw || "")
+  var text = String(false)
   var size = utf8Length(text)
   if (!text || size > MAX_SAVE_BYTES) return { valid: false, reason: size > MAX_SAVE_BYTES ? "oversized" : "missing", state: null }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 8.596382

[Killed] EqualityOperator
JourneyRules.js:1057:16
 function parseSave(raw) {
   var text = String(raw || "")
   var size = utf8Length(text)
-  if (!text || size > MAX_SAVE_BYTES) return { valid: false, reason: size > MAX_SAVE_BYTES ? "oversized" : "missing", state: null }
+  if (!text || size <= MAX_SAVE_BYTES) return { valid: false, reason: size > MAX_SAVE_BYTES ? "oversized" : "missing", state: null }
   try {
     var document = JSON.parse(text)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.81677

[Killed] ConditionalExpression
JourneyRules.js:1057:7
 function parseSave(raw) {
   var text = String(raw || "")
   var size = utf8Length(text)
-  if (!text || size > MAX_SAVE_BYTES) return { valid: false, reason: size > MAX_SAVE_BYTES ? "oversized" : "missing", state: null }
+  if (false) return { valid: false, reason: size > MAX_SAVE_BYTES ? "oversized" : "missing", state: null }
   try {
     var document = JSON.parse(text)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.87584
  type: 'test'
  ...

[Killed] BlockStatement
JourneyRules.js:1058:7
   var text = String(raw || "")
   var size = utf8Length(text)
   if (!text || size > MAX_SAVE_BYTES) return { valid: false, reason: size > MAX_SAVE_BYTES ? "oversized" : "missing", state: null }
-  try {
-    var document = JSON.parse(text)
-    if (!document || document.schemaVersion !== SAVE_SCHEMA_VERSION || !document.state)
-      return { valid: false, reason: "incompatible", state: null }
-    if (document.state.gameVersion === "0.1.0" && document.state.rulesProfile === undefined) {
-      document.state.rulesProfile = "omatrail"
-      if (document.state.ending && document.state.ending.rulesProfile === undefined)
-        document.state.ending.rulesProfile = "omatrail"
-    }
-    if (document.state.gameVersion === "0.1.0" && document.state.lastHuntMile === undefined)
-      document.state.lastHuntMile = -1
-    if (document.state.gameVersion === "0.1.0" && Array.isArray(document.state.party)) {
-      document.state.party.forEach(function(member) {
-        if (member && member.ailment === undefined) member.ailment = null
-      })
-    }
-    var errors = validate(document.state)
-    return errors.length ? { valid: false, reason: "invalid", state: null, errors: errors }
-      : { valid: true, reason: "ok", state: document.state }
-  } catch (error) {
+  try {} catch (error) {
     return { valid: false, reason: "malformed", state: null }
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.725681

[Killed] ConditionalExpression
JourneyRules.js:1060:9
   if (!text || size > MAX_SAVE_BYTES) return { valid: false, reason: size > MAX_SAVE_BYTES ? "oversized" : "missing", state: null }
   try {
     var document = JSON.parse(text)
-    if (!document || document.schemaVersion !== SAVE_SCHEMA_VERSION || !document.state)
+    if (true)
       return { valid: false, reason: "incompatible", state: null }
     if (document.state.gameVersion === "0.1.0" && document.state.rulesProfile === undefined) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.08025

[Killed] ConditionalExpression
JourneyRules.js:1060:22
   if (!text || size > MAX_SAVE_BYTES) return { valid: false, reason: size > MAX_SAVE_BYTES ? "oversized" : "missing", state: null }
   try {
     var document = JSON.parse(text)
-    if (!document || document.schemaVersion !== SAVE_SCHEMA_VERSION || !document.state)
+    if (!document || false || !document.state)
       return { valid: false, reason: "incompatible", state: null }
     if (document.state.gameVersion === "0.1.0" && document.state.rulesProfile === undefined) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.610627
  type: 'test'

[Killed] BooleanLiteral
JourneyRules.js:1061:23
   try {
     var document = JSON.parse(text)
     if (!document || document.schemaVersion !== SAVE_SCHEMA_VERSION || !document.state)
-      return { valid: false, reason: "incompatible", state: null }
+      return { valid: true, reason: "incompatible", state: null }
     if (document.state.gameVersion === "0.1.0" && document.state.rulesProfile === undefined) {
       document.state.rulesProfile = "omatrail"
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.865601

[Killed] EqualityOperator
JourneyRules.js:1062:9
     var document = JSON.parse(text)
     if (!document || document.schemaVersion !== SAVE_SCHEMA_VERSION || !document.state)
       return { valid: false, reason: "incompatible", state: null }
-    if (document.state.gameVersion === "0.1.0" && document.state.rulesProfile === undefined) {
+    if (document.state.gameVersion !== "0.1.0" && document.state.rulesProfile === undefined) {
       document.state.rulesProfile = "omatrail"
       if (document.state.ending && document.state.ending.rulesProfile === undefined)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.636235

[Killed] ConditionalExpression
JourneyRules.js:1062:51
     var document = JSON.parse(text)
     if (!document || document.schemaVersion !== SAVE_SCHEMA_VERSION || !document.state)
       return { valid: false, reason: "incompatible", state: null }
-    if (document.state.gameVersion === "0.1.0" && document.state.rulesProfile === undefined) {
+    if (document.state.gameVersion === "0.1.0" && true) {
       document.state.rulesProfile = "omatrail"
       if (document.state.ending && document.state.ending.rulesProfile === undefined)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.198751

[Killed] LogicalOperator
JourneyRules.js:1064:11
       return { valid: false, reason: "incompatible", state: null }
     if (document.state.gameVersion === "0.1.0" && document.state.rulesProfile === undefined) {
       document.state.rulesProfile = "omatrail"
-      if (document.state.ending && document.state.ending.rulesProfile === undefined)
+      if (document.state.ending || document.state.ending.rulesProfile === undefined)
         document.state.ending.rulesProfile = "omatrail"
     }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.000402
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:1064:11
       return { valid: false, reason: "incompatible", state: null }
     if (document.state.gameVersion === "0.1.0" && document.state.rulesProfile === undefined) {
       document.state.rulesProfile = "omatrail"
-      if (document.state.ending && document.state.ending.rulesProfile === undefined)
+      if (false)
         document.state.ending.rulesProfile = "omatrail"
     }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.847158
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:1067:9
       if (document.state.ending && document.state.ending.rulesProfile === undefined)
         document.state.ending.rulesProfile = "omatrail"
     }
-    if (document.state.gameVersion === "0.1.0" && document.state.lastHuntMile === undefined)
+    if (true)
       document.state.lastHuntMile = -1
     if (document.state.gameVersion === "0.1.0" && Array.isArray(document.state.party)) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 3.944869
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:1067:51
       if (document.state.ending && document.state.ending.rulesProfile === undefined)
         document.state.ending.rulesProfile = "omatrail"
     }
-    if (document.state.gameVersion === "0.1.0" && document.state.lastHuntMile === undefined)
+    if (document.state.gameVersion === "0.1.0" && true)
       document.state.lastHuntMile = -1
     if (document.state.gameVersion === "0.1.0" && Array.isArray(document.state.party)) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.488148
  type: 'test'

[Killed] UnaryOperator
JourneyRules.js:1068:37
         document.state.ending.rulesProfile = "omatrail"
     }
     if (document.state.gameVersion === "0.1.0" && document.state.lastHuntMile === undefined)
-      document.state.lastHuntMile = -1
+      document.state.lastHuntMile = +1
     if (document.state.gameVersion === "0.1.0" && Array.isArray(document.state.party)) {
       document.state.party.forEach(function(member) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.328142

[Killed] BlockStatement
JourneyRules.js:1069:88
     }
     if (document.state.gameVersion === "0.1.0" && document.state.lastHuntMile === undefined)
       document.state.lastHuntMile = -1
-    if (document.state.gameVersion === "0.1.0" && Array.isArray(document.state.party)) {
-      document.state.party.forEach(function(member) {
-        if (member && member.ailment === undefined) member.ailment = null
-      })
-    }
+    if (document.state.gameVersion === "0.1.0" && Array.isArray(document.state.party)) {}
     var errors = validate(document.state)
     return errors.length ? { valid: false, reason: "invalid", state: null, errors: errors }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.18711

[Killed] EqualityOperator
JourneyRules.js:1069:9
     }
     if (document.state.gameVersion === "0.1.0" && document.state.lastHuntMile === undefined)
       document.state.lastHuntMile = -1
-    if (document.state.gameVersion === "0.1.0" && Array.isArray(document.state.party)) {
+    if (document.state.gameVersion !== "0.1.0" && Array.isArray(document.state.party)) {
       document.state.party.forEach(function(member) {
         if (member && member.ailment === undefined) member.ailment = null
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.118653

[Killed] BlockStatement
JourneyRules.js:1070:53
     if (document.state.gameVersion === "0.1.0" && document.state.lastHuntMile === undefined)
       document.state.lastHuntMile = -1
     if (document.state.gameVersion === "0.1.0" && Array.isArray(document.state.party)) {
-      document.state.party.forEach(function(member) {
-        if (member && member.ailment === undefined) member.ailment = null
-      })
+      document.state.party.forEach(function(member) {})
     }
     var errors = validate(document.state)
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.120816
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:1071:13
       document.state.lastHuntMile = -1
     if (document.state.gameVersion === "0.1.0" && Array.isArray(document.state.party)) {
       document.state.party.forEach(function(member) {
-        if (member && member.ailment === undefined) member.ailment = null
+        if (false) member.ailment = null
       })
     }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 4.864849
  type: 'test'

[Killed] ConditionalExpression
JourneyRules.js:1071:23
       document.state.lastHuntMile = -1
     if (document.state.gameVersion === "0.1.0" && Array.isArray(document.state.party)) {
       document.state.party.forEach(function(member) {
-        if (member && member.ailment === undefined) member.ailment = null
+        if (member && true) member.ailment = null
       })
     }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 5.486657
  type: 'test'

[Killed] BooleanLiteral
JourneyRules.js:1075:37
       })
     }
     var errors = validate(document.state)
-    return errors.length ? { valid: false, reason: "invalid", state: null, errors: errors }
+    return errors.length ? { valid: true, reason: "invalid", state: null, errors: errors }
       : { valid: true, reason: "ok", state: document.state }
   } catch (error) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 4.780162

[Killed] BooleanLiteral
JourneyRules.js:1076:18
     }
     var errors = validate(document.state)
     return errors.length ? { valid: false, reason: "invalid", state: null, errors: errors }
-      : { valid: true, reason: "ok", state: document.state }
+      : { valid: false, reason: "ok", state: document.state }
   } catch (error) {
     return { valid: false, reason: "malformed", state: null }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible
ok 1 - seed normalization and random draws are reproducible
  ---
  duration_ms: 7.251209
  type: 'test'
  ...

[Killed] BlockStatement
JourneyRules.js:1077:19
     var errors = validate(document.state)
     return errors.length ? { valid: false, reason: "invalid", state: null, errors: errors }
       : { valid: true, reason: "ok", state: document.state }
-  } catch (error) {
-    return { valid: false, reason: "malformed", state: null }
-  }
+  } catch (error) {}
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.079149

[Killed] BooleanLiteral
JourneyRules.js:1078:21
     return errors.length ? { valid: false, reason: "invalid", state: null, errors: errors }
       : { valid: true, reason: "ok", state: document.state }
   } catch (error) {
-    return { valid: false, reason: "malformed", state: null }
+    return { valid: true, reason: "malformed", state: null }
   }
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: seed normalization and random draws are reproducible

ok 1 - seed normalization and random draws are reproducible

  ---
  duration_ms: 5.476467
